[
  {
    "url": "https://www.internships.com/posting/ccm_6794e696-2359-4d39-9547-a4f4c1163bb6",
    "position": "Cutting Edge Computer Science Internship",
    "location": {
      "city": "Remote",
      "state": "",
      "country": ""
    },
    "description": "The Rise Network has an internship opportunity for creative and imaginative Computer Science majors who are interested in utilizing their skills to assist in setting the pace and leading the pack through our multi-media entertainment network.\n\nCandidates must be forward-thinking and possess a strong knowledge and understanding of the digital media landscape, including AI and various social media websites functionalities.\n\nInterns for this position will need strong critical thinking skills in order to integrate into our vibrant and passionate team. We are very excited to share this exciting experience with interns who are hoping to gain online and real world, hands on experience.\n\nThis is a year-round internship that works according to the intern’s availability that provides students with an opportunity to enhance their learning experience in their field(s) of interest.\n\nThis is a non-paid internship that will become a paid internship; however, only academic credit is currently available.",
    "company": "The Rise Network",
    "contact": "",
    "posted": "10 months ago",
    "due": "",
    "lastScraped": "2021-11-11T02:55:42.149Z"
  },
  {
    "url": "https://www.internships.com/posting/1668078a-d4ec-49b5-b6f5-5267cd1a354a",
    "position": "Computer Programming Instructor (Intern-Unpaid/Part-Time)",
    "location": {
      "city": "Remote",
      "state": "",
      "country": ""
    },
    "description": "\n\n\nWe are a team of technology & education experts with the mission to inspire the next generation of technologists. \n\n\n\n\nIQuition offers Block-based, Text-based and Advanced Coding Programs for kids of all ages, grade levels and prior coding experience levels. Learn all about IQuition’s Intuitive and Fun Game Design & Coding Courses and Curriculum on www.IQuition.com\n\n\n\n\nTHE IQuition APPROACH\n\nPersonalized Learning Pathway: Every IQuition student follows a customized pathway based on his/her strengths, goals, motivation and individual learning pace.\nPerformance-based Achievement Levels: Our performance-based assessments measure the student's ability to apply their knowledge and every student must demonstrate the mastered skills to progress to the next level.\nCompetency-based Progression: We continually assess every student’s progress towards their individual goals.\nReward and Incentive System: The students are rewarded whenever they achieve a learning milestone and demonstrate mastery.\n\n\n\n\n\n\n\nYour Responsibilities:\n\nTeach coding/programming to kids ages 7-16 (Scratch, Python, Minecraft Programming)\nOnce weekly online class with a student on Microsoft Teams.\nComplete weekly student progress report.\n\n\n\n\n\n",
    "company": "IQuition Intuitive Learning",
    "contact": "",
    "posted": "9 months ago",
    "due": "",
    "lastScraped": "2021-11-11T02:55:48.256Z"
  },
  {
    "url": "https://www.internships.com/posting/f454677e-2c09-44e0-b0a7-b0b8f44eba9a",
    "position": "National Business, Marketing, Media, Film, Computer Science, Management, Entrepreneurial, Virtual Internship",
    "location": {
      "city": "Remote",
      "state": "",
      "country": ""
    },
    "description": "The National STEM Honor Society\n\nApplication Page: https://www.nstem.org/internships/\n\n\n\n\n\n\n\nNational Business, Marketing, Media, Film, Computer Science, Management, Entrepreneurial, Virtual Internship\n\n\n\n\nTo learn more about NSTEM: \n\nFacebook: https://www.facebook.com/nstemhs\nInstagram: https://www.instagram.com/nstemhs\nTwitter: https://twitter.com/nstemhs\nLinkedIn: https://www.linkedin.com/company/national-stem-honor-society\nYouTube: https://www.youtube.com/watch?v=juHYDfYtB8Q\nPinterest: https://www.pinterest.com/nstemhs\nTikTok: https://www.tiktok.com/@nstemhs\nNewsroom/Blog: https://www.nstem.org/newsroom-blog \nApplication Portal: https://docs.google.com/forms/d/e/1FAIpQLSehWKx8qVVAp1F7LO4M3L-q5F4w0IWDxocg0Pws0JQU6d-ZWQ/viewform\n\n \n\nThis internship can be fulfilled virtually from anywhere around the globe!  \n\n\n\n\nDuration Requirements: Whether the internship is for credit or not, NSTEM hires interns for a minimum of 240 total hours with no maximum, and a 4 month (15 hour/week) minimum. We have had interns with us in our parent company for as long as two years and are still part of the organization.    \n\n \n\nThe National STEM Honor Society (NSTEM) has been in the development stage for 3+ years and went live in February 2020 with the goal of opening thousands of Chapters across the nation as quickly as possible! Our mission is to inspire innovation and recognize student excellence From K to CareerTM in the fields of Science, Technology, Engineering, and Mathematics. That’s right, we are going to be inspiring kids as young as Kindergarten to get involved and stay involved in STEM hopefully for the rest of their education and careers! \n\n\n\n\nPlease visit our website at www.nstem.org to really understand NSTEM and the benefits of starting an NSTEM chapter. Also, please take a look at the National STEM Honor Society social media platforms on Twitter, Instagram, Facebook, and LinkedIn.  \n\n\n\n\nWhat are the opportunities to get involved as an intern? What do interns do for the National STEM Honor Society?  The National STEM Honor Society is an educational and business start-up organization that provides University interns with interesting, diverse, and stimulating work opportunities. At NSTEM, you are not limited to just one role, and we encourage you to take advantage of the opportunity to explore a variety of roles, experiences, opportunities, and responsibilities. Supporting your specific interests and individual learning goals, you will engage in focused learning experiences working on projects essential to the day-to-day operation of the company where you will receive guidance and resources to apply knowledge and skills to your emerging professional lives. As an intern with National STEM Honor Society, you can perform a myriad of real and meaningful tasks. \n\n \n\nLeadership and Management:  Are you a leader or would you like to be?  The National STEM Honor Society Internship program is looking to identify and bring on leaders who will continue to drive toward our mission of helping as many students as possible as quickly as possible!  NSTEM is an intern driven organization where interns are quickly promoted into leadership positions for those who exhibit leadership and management attitudes and skills. There are many opportunities to take on leadership positions at NSTEM, to lead small and large teams on a myriad of projects. We have several roles including Senior Directors, Directors, Department Managers, Team Leaders, and Project Managers. All the roles have varying degrees of responsibilities ranging from managing a small team dedicated to a single project, to being a Department Manager managing several teams and projects, to becoming a Senior Director working and learning side by side with our Administrative management team. This is an opportunity to quickly hone your leadership and management skills, two of the most future ready and important skills to learn and build upon  as you continue your journey through life and career.\n\nSKILLS REQUIRED: These soft skills include that ability to mentor interns and to train them quickly toward a vision, quick and positive communications, reliability, team building, patience and empathy.  The logistical skills include being organized, running meetings, assigning tasks, following up, identifying other leaders for promotion and using Google Docs and Trello to manage the goal directed activities of your team.   \n\n\n\n\nSales, Partnership and Sponsorship Strategies:  Some of the most important keys to helping as many students and educators as we can as quickly as we can in STEM education enhancement, inspiration and recognition is to open school based chapters of NSTEM through partnerships with key organizations who believe what we believe. Through sponsorships from companies, non-profits and individuals who want to sponsor chapters in their communities and through follow up of interested schools from our marketing efforts. To do this, NSTEM employs a robust state of the art engagement software called Outreach (https://www.outreach.io/) with a training program offered by Outreach University which allows interns to achieve expertise and badges of accomplishment rapidly.  As this software is used so widely in the business world, getting this recognition and experience is a valuable experience for future employment and careers.  Additionally, NSTEM has an effective and growing LinkedIn (about.linkedin.com/) approach to relationship building with superintendents, principals and STEM enthusiasts across the country and the world.  Interns will work closely with the President of NSTEM, Ken Hecht to strategise, plan and implement effective day to day activities in order to help fulfill our mission.  SKILLS REQUIRED:  The skills required are the ability to think strategically, to drive growth through the effective use of the tools that we have selected and to improve our processes as we grow.  The ability to see the big picture is a must as effective communications will be critically important with people at the highest professional and educational levels in the country.  \n\n\n\n\nAnalytics: The National STEM Honor Society is working to develop STEM campaigns on a national, targeted basis centered around discussions on STEM access, equity, and support, as well as their relationship to NSTEM’s mission. These campaigns, via email, social media, and video, need to be analyzed for effectiveness across several platforms. Interns will work closely with analytics software, including Hootsuite Pro, Google Analytics, and Outreach Analytics. Interns will communicate closely with other teams, including web, video production, and email sending to address how campaigns are performing and to increase Search Engine Optimization (SEO) for the NSTEM website. Data visualizations are created to present data to other departments using Google Data Studio. These focus on presenting data in a clear and concise manner, so it is easily understood at first glance. Company-wide analytics are presented weekly and targeted marketing demographic data is presented monthly. SKILLS REQUIRED: Needs to be curious and wanting to go in depth to do background research for analytics which is given. Eager to start new projects and willingness to help. Applicants with a passion for analytics and skills in verbal and written communication, presentations, spreadsheets, and attention to detail; Proficiency in Google Analytics, Hootsuite, Google SEO, Google Data Studio, or Outreach is a plus. \n\n\n\n\nSocial Media Marketing: The National STEM Honor Society has STEM campaigns on a national and international, targeted basis.  Our messages are centered around discussions on STEM inspiration, access, equity, and support in a very graphical way. There are several specific target markets, each with very different characteristics in terms of sending customized, strategic messages employing the correct social media platforms for each target market. Team members will be in charge of interacting and engaging with different users by creating brand awareness, gaining leads/sales, developing a voice for the company, and relationships with our followers on our different platforms: Instagram, Twitter, Facebook, LinkedIn, Pinterest, TikTok, and YouTube. Interns will create and implement different strategies to help increase engagement on the platforms. Interns will work closely with digital marketing software, including Hootsuite Pro, and Canva. Team members specialize in creating appealing digital media for platform sharing, and engaging in an editing/writing process for curated content. Platforms the team manages currently are Instagram, FaceBook, LinkedIn, Pinterest, Twitter, and TikTok. In addition, there will be opportunities to learn the skills needed for digital advertising in order to reach STEM educators and organizations across the United States and the world. Interns will also work with other teams, including graphics, web, video production, and email sending to centralize a sales strategy that reaches potential customers. SKILLS REQUIRED: Applicants with experience in social media management, posting, and highly developed writing skills, basic knowledge on social media platforms, self-motivated\n\nContent: As a core component of the Marketing & Social Media Department, the National STEM Honor Society content and content management team focuses on both collecting and sharing content of other creators and producing original content to be shared on our platforms.  Mapping and strategizing content is a key part of identifying and catering to target market audiences, and forming valuable relationships with our customers.  Team members will share and create platform or persona-specific content for Facebook, Instagram, Twitter, Linkedin, TikTok, and Pinterest, managing posts via the Hootsuite platform.  SKILLS REQUIRED:  Applicants should have familiarity with the above social media platforms and a broad knowledge of social media/marketing advertising strategies. Those with experience in building up personal or company social media profiles is a plus!\nGraphic Design: As a team/division of the Marketing & Social Media Department, National STEM Honor Society graphics team focuses on creating visually appealing banners, icons, boards, postings and blog graphics.  Creative graphics experience is essential in working to expand our branding in all communication platforms including social media, website, PR, email sales and e-commerce.  Inspirational visual content is critical to drive engagement and clicks on social media and the focus is on creating compelling visual assets for every campaign to engage our prospects on an emotional and value added basis. SKILLS REQUIRED:  Candidates must either be studying graphics or have significant experience in graphic design.  Experience in Canva is highly preferred as NSTEM has settled on this as our standard. Experience with Adobe Creative Suite is a plus!\nInteractions: Team members will be in charge of interacting and engaging with different users by creating brand awareness, gaining leads/sales, developing a voice for the company, and relationships with our followers on our different platforms: Instagram, Twitter, Facebook, LinkedIn, Pinterest, TikTok, and YouTube. Interns will research, create and implement different strategies to help increase engagement on the different platforms. Interns will also work closely with the analytics team to determine strategies to help our platform’s engagement increase. SKILLS REQUIRED: Applicants with experience in social media platforms, basic knowledge on the social media platforms, highly developed writing skills, and self-motivation.\nContent Management: This team is essential to the organization and execution of many of the components of the Social Media Department. Through the management of the Department’s Trello Board, team members serve as a bridge between the other teams within social media, connecting graphics, content, and interactions into a streamlined system. Members of the content management team will also be responsible for scheduling and posting the social media content created by other social media teams on Hootsuite. SKILLS REQUIRED: Applicants with strong organization, time management, and attention to detail. Given that Content Management members need to publish many social media posts before they are scheduled to be released, being punctual and keeping up with deadlines is crucial for this position. Experience with Trello and Hootsuite is a plus!\n\n\n\n\nEmail Marketing: This is an exciting and important department as we open Chapters across the country and internationally.  Learn how to conduct an effective email marketing program starting with strategic market research on targeted STEM and other schools across the country and the world.  This strategic market research of prospect schools is segmented into the personas of elementary, middle, high school and colleges/universities educators, students and parents. Then be involved in specialized market research where you will do in depth research on given schools and educators.  And finally you will be involved in outreach to these schools with email writing and sequencing on a personalized basis with the state of the art engagement software, OutreachIO (https://www.g2.com/products/outreach/reviews).  You will learn about the very detailed analytics that we employ to quantify our success and to make modifications based upon our constantly tracked analytics on our efforts. Strategic Market Research, Specialized Research and Outreach are the lifeblood of our company as we build lasting relationships with over 100,000 schools in the US alone, to say nothing of our international efforts.  We believe that what we are doing is of great value and importance to students of all ages and socio-economic backgrounds and to the future of our country and the world. You will learn to market with empathy, to focus on the issues of students, parents and educators and to target specific personas for greatest effectiveness in improving their educational and career experiences.  These are life long skills which will serve you well throughout your future endeavors. SKILLS REQUIRED: Experience in all aspects of Google Drive, including Google Sheets and Docs, as well as creating and organizing Google Drive. Search Engine Keyword proficiency is a plus in obtaining relevant and important contact information for future prospects. Utilizing proper time management and organization is key. Proficiency in Outreach is a plus.  The ability to think strategically and strong written communication skills are a plus. Driven in terms of research and collaborating well with others. \n\n\n\n\nCustomer Service, Member Support & Care: In this department we add value to our chapters and people at every opportunity. We engage with different public audiences and learn how to effectively communicate with them while supporting our Chapter members and their administrative teams including Directors and Advisors. Our goal is to have new chapters and for those chapters to keep signing up for NSTEM every year. In order to do this we focus on our existing chapters, communicate with them often, and add satisfaction at every opportunity. Interns should have a desire to understand every school and their system, where they are in STEM education, as well as learn how to personalize outgoing emails to build long term relationships and open chapters across the country and the world. SKILLS REQUIRED: Hard skills will be acquired via Outreach software (the top email personalized email sending software in the market) and email strategy, as well as more soft skills such as connecting with customers, communication, and adaptability. Experience in all aspects of Google Drive, including Google Sheets and Docs. Search Engine Optimization and keyword proficiency is a plus in obtaining relevant and important contact information for future prospects. Utilizing proper time management and organization is key. \n\n\n\n\nPublic Relations (PR): Specialists work closely with our marketing team and are responsible to build and maintain a positive public image for our company. They are in charge of establishing and maintaining relationships with our Chapters, greater community, interns and staff, and public interest groups by writing press releases and other media communications, researching potential contacts and partners, and responding to requests for information. The PR Department will work closely with the Social Media Department managing the Pinterest account. Skills required for each team: \n\nBlogs: They create media, from press releases to blogs, that shape public opinion of the company or organization and increase awareness of its brand. The skills required are strong creative thinking and writing skills; passion about topics to write about; willingness to learn; excellent time management; motivation to do deep research; in-depth knowledge of GSuite office and various Google applications; independent and collaborative nature; Work ethic and willingness to learn; strong communication; enthusiasm for PR; must have a strong desire to write.\n\nWriting Sample: Write a blog about a member of the STEM community of your choosing. Take into account this has to be catchy, of around 300-800 words, and, most importantly, has to show your passion for writing! \n\nWebinars: The Webinars team is in charge of… you guessed it...  Webinars! Members of the Webinars team need to have strong communication and be on top of the roles and responsibilities assigned to them. There are a lot of different responsibilities, ranging from creating presentations/handling social media posts for the webinars to helping with content or contacting guest speakers. There is also an opportunity to work in the technical side of webinars, where one can handle the responsibility of making sure the webinar runs smoothly. No previous experience is needed but any previous teamwork skills are strongly recommended! \nEditorial team: The editorial team is responsible for proofreading writing pieces that have been written by the blogs team. Members of the Editorial Team need to be thoughtful and dedicated in regards to their work. It is not necessary for them to have the relevant skills entirely mastered before joining the team, but someone with writing or editing experience is preferred and a willingness to learn is also important. Because of how detail oriented this team is, only members of the blogs team that have shown outstanding writing and organizational skills will be invited to join the team (in other words, first time applicants will be required to have experience writing on the NSTEM blogs team before having the opportunity to work on the Editorial team) \n\n\n\n\nE-Commerce & Merchandise: Researching and discovering new merchandise that matches our mission.  This department includes chapter apparel and merchandise, personal apparel, and recognition items (such as pins, cords, certificates). Building relationships with e-commerce experts and fulfillment centers outside of NSTEM along with researching specific products to maximize profit.  Promoting NSTEM in creative ways our line of merchandise is a key objective. SKILLS REQUIRED:  E-Commerce requires the following skillset: critical thinking, persistent work ethic and willingness to learn, express enthusiasm and creativity for creating new, captivating content, creative writing, organization, and working with various personas.  An in-depth knowledge of GSuite office and various Google applications is essential for NSTEM interns across the board.  \n\n\n\n\nVideo, Film, & Media Production: The National STEM Honor Society is looking to expand its video content. We're seeking interns who are ready to add vital contributions in laying the groundworks for a sustainable, constant flow of high quality, branded content. Interns will work remotely and collaboratively to conceptualize and produce a wide catalogue of NSTEM promotional videos for use on the NSTEM website and social media outlets. The goal is to create a brand that will be the backbone of the company for years to come. Interns on this team will manage NSTEM’s YouTube account as well. Video interns need to be able to take raw footage and edit it into a compelling narrative; the end product will primarily be promotional videos and social media content. Video interns will also have free access to some courses from the online learning platform Udemy. Courses include tutorials on basic video editing software such as ShotCut as well as industry-standard software such as Adobe Premiere and After Effects. Interns will complete their internship with a portfolio of work they can include in their video editing or filmmaking job applications, and certificates from any Udemy courses they compete. SKILLS REQUIRED: At least basic video editing skills with programs such as Adobe Premiere, Final Cut, DaVinci Resolve, Shotcut, iMovie, or any other common video editing software (experience with Audacity, Audition, and/or After Effects is a plus); willingness to improve their skills if only at the basic level; ability to create a story or coherent narrative out of raw footage; self-motivated and creative; able to take an idea and turn it into a polished video without a lot of hand-holding.  \n\n\n\n\nWebsite & Technology: NSTEM is built on the Wordpress platform, needing constant updates.  Our entire social media campaign will be aimed at sending targeted persons to different parts of our website for different desired results.  The key result is to increase the number of chapters across the country in record time.  We are looking for Innovators, problem solvers and tech-savvy interns to join NSTEM’s Tech Team. Tech team is a group of NSTEM interns that have a knack for technology use and are adept at helping others. These interns are problem solvers, critical thinkers, and enjoy staying on top of new technologies and best practices that will drive the mission of NSTEM. Tech Team members are able to troubleshoot issues and serve as the front line for tech support issues such as logins and will aid with GSuite apps for our global users. They are able to create helpful learning materials like tutorials and documentation. In addition, they  support new staff and interns as they are onboarded. Tech Team members are innovators and come up with ways to expand the knowledge and confidence of all NSTEM’s constituents. SKILLS REQUIRED: customer service, tech support, GSuite, strong communication, digital marketing, change management, user experience, web design. Willingness to collaborate and a team-oriented mindset; Good work ethic and a willingness to learn; Drive to make the best first impression for NSTEM.\n\n\n\n\nHuman Resources (HR): Our team specialists are responsible for recruiting, screening, interviewing and placing team members into teams. They oversee team members and ensure they are being challenged, meeting expectations, enjoying their internships and not overwhelmed. They become specialists in their duties, consult with executives on strategic planning, and act as the constant link between our management team, including Directors and Project Managers; They manage our entire presence in the virtual world including all the recruiting platforms. They will be assigned some new roles in the future: planning, implementing, and evaluating employee relations and human resources policies, programs, and practices; maintain the work structure by updating job info; establishing a refined recruiting and interviewing program; counseling managers on candidate selection; conducting and analyzing exit interviews; recommending changes; and preparing interns for assignments by establishing and conducting orientation and training programs. SKILLS REQUIRED: Communication and interpersonal skills; maintain professional decorum; open to meeting new people regularly; confident in their email sending abilities; exemplary behavior; organizational skills; google sheets/docs/drive/meet.\n\n\n\n\nBusiness Management & Operations: One of the most critical intern positions at NSTEM is a member of the Business Management Team, which collaborates on time sensitive and comprehensive decisions that impact the entire organization. Interns in this team will do market research and writing projects; legal research and implementation of findings; trademark work; handbook design, business and project plans and their Standard Operating Procedures, and pitching the highest level partnerships. Collectively the department team members work in concert to bring tangible results to our expansion. They assist the President and CEO in directing all the teams above to maximize output with minimizing effort. All members of the Business Management Team are responsible for curating a $200 million Resource Library and discover, evaluate, and enter these resources into the library. Additionally, the Business Management Team collaborates frequently with other departments such as Social Media, Website, Public Relations, E-commerce, and more. SKILLS REQUIRED: Communication and interpersonal skills; exemplary research skills; eager to learn and take on new challenges; technical platform skills a plus; organized; strong work ethic; enthusiasm for business; verbal and written communication skills; maintain professional decorum; open to meeting new people regularly; confident in their email sending abilities; excellent time management skills; strong creative thinking skills. \n\n\n\n\nAccredited Internship: NSTEM will work with colleges and universities to provide an experience that is directly related to desired learning outcomes and will complete all necessary paperwork. NSTEM provides this accredited opportunity by supporting interns in meeting program requirements and agrees to provide written documentation of work performed, recommendations, and evaluations for interns (according to performance standards). In order to offer an internship that complies with federal labor laws, NSTEM adheres to the following conditions:\n\nThe intern clearly understands that there is no expectation of compensation, this is an unpaid internship opportunity\nNSTEM internships provide training similar to that given in an educational environment\nThis internship can be tied to intern’s formal education programs by the receipt of academic credit\nNSTEM internships accommodate intern’s academic commitments and provide significant educational benefits\nThe duration of this internship provides beneficial learning for a specified amount of time \nIntern’s work complements, rather than displaces, the work of paid employees\nInternships are conducted without entitlement to a paid job at the conclusion of the internship\n\n\n\n\nMarket Research Weekly Work: We are helping as many students across the world as possible to instill STEM excitement and learning beginning in Kindergarten. In order to fulfill our mission, we need to communicate with educators who are passionate about helping their students in STEM. To meet our weekly goals of outreach to these educators, all NSTEM interns are required to spend no more than 2-hours a week collecting this critical and game changing information. When you are researching these educators, you are literally selecting the people who will be changing the lives of their students by taking part in the National STEM Honor Society. This role is one of the most important parts of working here at NSTEM. You will gain so many useful skills such as how to be a more effective researcher and how to remain organized all while playing a key role in expanding the size and scale of NSTEM. As Interns join NSTEM’s leadership, they take on increasing responsibilities and are not required to do weekly information collection.\n\n\n\n\nVolunteer Internship: Additionally, there is a \"Volunteer Internship\" option in addition to our official internship for academic credit. If an individual is interested in interning with NSTEM but is not tied to formal education, the internship will be classified as a \"Volunteer Internship.\" This option is offered for individuals who are not interested in receiving academic credit but rather the experience at NSTEM.\n\n\n\n\nIntern Goals & Learning Objectives: An intern working for the National STEM Honor Society can expect to meet their academic and learning goals, career exploration, and industry knowledge led by a committed staff providing an experience to meet them:  \n\nIncrease knowledge of the industry\nGrow leadership skills and learning to manage large projects\nGain experience in adapting to changing roles and environments\nConduct research and practice analytical/quantitative skills\nAssertively engage at work, conduct research effectively, write and present professionally, and make business decisions\nUnderstand and implement the roles and responsibilities of Project Managers, which include: \nTrack team members’ schedules, tasks, needs, and interests\nGain proficiency with tools such as G Suite, Trello, SmartSheets\nProvide a constant flow of work for team members\nEstablish and use effective communication channels with team members\nTreat team members & other managers with kindness, understanding and respect\nOrganize project materials to achieve outcomes efficiently     \nLearn to ramp up quickly on new projects\nLead by example, which means rolling up your sleeves and diving into the project!\n\n\n\n\nNSTEM’s Three Areas of Focus:\n\nEnroll NSTEM Chapters across the nation as quickly as possible by reaching out to educators, education departments and synergistic organizations,\nAttract corporate sponsors and foundation grants to provide funding to various NSTEM chapters,\nReach out and attract strategic partners and advisory council members.\n\n\n\n\nSupervision & Mentoring: All interns working for NSTEM will be mentored and supervised by our staff. Directors and Intern/Project Managers offer diverse educational backgrounds and expertise within their respective fields. Staff members provide opportunities for interns to work on projects that align with their learning goals with evaluation and constructive feedback along the way. NSTEM believes that successful internships go hand in hand with enjoyable internships. Staff will personally check-in with you throughout your internship experience and make adjustments as necessary in order to ensure that you achieve your internship goals.  Our team is constantly available for interns that work in the office as well as those that work virtually. Staff works with the requirements of colleges and universities in order to provide written feedback according to their specific policies. We work tirelessly to ensure all of our interns get the attention they need in pursuant to their internship goals. Interns also have the opportunity to learn from each other as there is much collaboration between both local and remote interns. \n\n\n\n\nBeing a part of the National STEM Honor Society expansion is an outstanding opportunity to grow your business, entrepreneurship, film production, social media, marketing, sales, service, and outreach capabilities while contributing to a team with the deep purpose of inspiring more STEM into the lives of our students, educators, sponsors, partners and advisory council members. Interns are given the opportunity to make strategic decisions and practice active learning and reflective thinking. They work in diverse teams with other interns, either in the office or through virtual connections. Because of the cooperative nature of NSTEM’s projects, interns are encouraged to form continuing networking relationships with each other. Team building is supported in order to set interns up to thrive in a collaborative environment. After interning at NSTEM, interns have valuable and applicable skills for finding meaningful and productive environmental work gaining valuable work experience in the process.\n\n\n\n\nTo learn more about NSTEM: \n\nFacebook: https://www.facebook.com/nstemhs\nInstagram: https://www.instagram.com/nstemhs\nTwitter: https://twitter.com/nstemhs\nLinkedIn: https://www.linkedin.com/company/national-stem-honor-society\nYouTube: https://www.youtube.com/watch?v=juHYDfYtB8Q\nPinterest: https://www.pinterest.com/nstemhs\nTikTok: https://www.tiktok.com/@nstemhs\nNewsroom/Blog: https://www.nstem.org/newsroom-blog \nApplication Portal: https://docs.google.com/forms/d/e/1FAIpQLSehWKx8qVVAp1F7LO4M3L-q5F4w0IWDxocg0Pws0JQU6d-ZWQ/viewform",
    "company": "National STEM Honor Society",
    "contact": "",
    "posted": "3 days ago",
    "due": "",
    "lastScraped": "2021-11-11T02:55:54.357Z"
  },
  {
    "url": "https://www.internships.com/posting/85b23d55-ca01-4bec-8b5a-4086245d4436",
    "position": "Education advisor",
    "location": {
      "city": "Remote",
      "state": "",
      "country": ""
    },
    "description": "Giving advice in education material making (Math/English/Computer Science)",
    "company": "Evergreen Mission and Education Foundation 2016 INC.",
    "contact": "",
    "posted": "2 months ago",
    "due": "",
    "lastScraped": "2021-11-11T02:56:00.775Z"
  },
  {
    "url": "https://www.internships.com/posting/41982279-8fe0-4a6f-873a-a5b91b2d3219",
    "position": "STATISTICS/ FINANCE RESEARCH - Virtual Internship",
    "location": {
      "city": "Remote",
      "state": "",
      "country": ""
    },
    "description": "We are currently offering a Statistics/ Finance Internship\n\n\n\n\nWe are performing research on aspects related to investment risk.\n\n\n\n\nThis internship is right for a Masters or PhD student in Statistics, Finance, or Computer Science.\n\n\n\n\nProject requires strong modeling skills or experience with Python and other languages and software.\n\n\n\n\nThis internship takes place remotely with most of the interactions taking place electronically and with almost daily conference calls. This is a virtual internship and a substantial time commitment is required.",
    "company": "Elle Investments",
    "contact": "",
    "posted": "7 days ago",
    "due": "",
    "lastScraped": "2021-11-11T02:56:06.897Z"
  },
  {
    "url": "https://www.internships.com/posting/e2dfa21c-c4ea-4bb9-a5cf-56d91b150931",
    "position": "Multimedia Content Intern",
    "location": {
      "city": "Remote",
      "state": "",
      "country": ""
    },
    "description": "\n\n\nDo you have a passion for music? Ever wanted to learn about music programming, promotion and content management systems? This internship is ideal for Communication and Computer Science majors.\n\n\n\n\nAmerican Weekend Entertainment is looking for one dedicated individual to help manage, schedule, upload and post content for our website and mobile app.\n\n\n\n\nThis internship is virtual and will require 5-7 hours per week. We understand everyone has busy lives, so we try to make it as easy as possible for our interns to work while attending school or a second job.\n\n\n\n\nIf this sounds interesting, please apply!  At this time, we are looking for that person who is passionate about music and the music business.",
    "company": "American Weekend Entertainment, Inc.",
    "contact": "",
    "posted": "5 days ago",
    "due": "",
    "lastScraped": "2021-11-11T02:56:13.003Z"
  },
  {
    "url": "https://www.internships.com/posting/49cd7653-38d9-49eb-9904-299f1cbf602e",
    "position": "WEB PROGRAMMER Remote Internship",
    "location": {
      "city": "Remote",
      "state": "",
      "country": ""
    },
    "description": "We are currently offering a Web Programmer internship - HTML, CSS, PHP, JS, MySQL\n\n\n\n\nThe internship is ideal for someone who'd like to develop real-world coding experience by working on real projects. You'll have the opportunity to gain practical experience with a variety of tools.\n\nThe ideal candidate is completing a graduate or undergraduate program in computer science or MIS at a US university and is eager to get a head-start by participating in the development of real-life applications. This opportunity is intended for a programmer who is particularly interested in developing a rather broad range of skills and experience.\n\n\n\n\nThis internship takes place remotely with most of the interactions taking place electronically and with almost daily conference calls. This is a virtual internship and a substantial time commitment is required.\n\n\n",
    "company": "Elle Investments",
    "contact": "",
    "posted": "7 days ago",
    "due": "",
    "lastScraped": "2021-11-11T02:56:19.096Z"
  },
  {
    "url": "https://www.internships.com/posting/ccm_f4876606-ec8b-4677-99c8-85ec528b4cc0",
    "position": "Accounting Information System Specialist intern",
    "location": {
      "city": "Remote",
      "state": "",
      "country": ""
    },
    "description": "Vision: youbloom’s vision is to make live music performance easier and better for all.\n\n \n\nMission: youbloom’s mission is to expand the delivery of amazing live music experiences by increasing the connectedness of fans, artists, promoters and venues.\n\n\n\n\nMore about youbloom:\n\n\n\n\nhttps://drive.google.com/file/d/1gIjXS2di0FsKBlbbjNTKD2FgB0bsFrXO/view?usp=sharing\n\n\n\n\nWe're currently seeking an Accounting major with minor or emphasis in Management Information Systems or Computer Science to become part of our team.\n\n\n\n\nWhat you'll do\n\n\n\n\nDemonstrate a clear pride of ownership for the team-owned applications.\n\nAssist with the maintenance, administration and support of Finance Systems, and ancillary systems, in alignment w/ Finance programs, goals and initiatives.\n\nAssist with developing, defining, and documenting business requirements that describe the business need and solution scope, and communicate them effectively to IT, HR, and business stakeholders within Treasury, Internal Audit, Tax, etc. \n\nAssist with the system configurations and maintenance, development and maintenance of a reporting repository and support reporting and analytics requests.\n\nContribute to the maintenance and accuracy of systems data, in the form of data loads and audits.\n\n\n\n\n\n\n\nRequired skills:\n\n\n\n\nBachelor's degree in MIS or Computer Science, Finance or Business Administration or an equivalent combination of education.\n\nStrong analytical skills, excellent communication skills (written and oral).ra\n\nA working knowledge of one of more of the following applications desirable: DB2, Cognos Analytics, SPSS, JIRA, Slack, Splunk, advanced Excel, Robotic Process Automation, and other new technology data analytics tools.\n\n\n\n\n\n\n\nJob Type: Internship\n\nThe intern term is 3 to 6 months. This is a non-paid internship, with flexible hours (minimum of 16 hours per week) to reflect your necessary college credit requirements. If the intern could hold the position very well, we may be able to offer a more full or part-time position with compensation.\n\n\n\n\n\n\n\nAs part of the application process, please answer all the questions given below:\n\n\n\n\nAre you aware that this is an unpaid intern position? \n\n\n\n\nHow many hours a week can you commit? (all activity is virtual) \n\n\n\n\nHow many months would you like to intern with youbloom? \n\n\n\n\nDo you have any experience in the music industry? \n\n\n\n\nWhy do you believe you will be a good fit for this position? \n\n\n\n\nDo you have any current obligations that might affect your ability to meet deadlines? \n\n\n\n\nDo you have the ability to work autonomously, and collaborate with a team? Explain? \n\n\n\n\nCould you provide details of what your college requires from youbloom for you to intern with us? \n\n\n\n\nWhat is it about youbloom’s values and vision/mission that appeal to you? (About youbloom http://www.youbloom.com/about/ ) \n\n\n\n\nWhat are your 5 favorite songs? (optional) \n\n\n\n\nYour top 5 bands/artists? (optional) ",
    "company": "youbloom",
    "contact": "",
    "posted": "2 days ago",
    "due": "",
    "lastScraped": "2021-11-11T02:56:25.212Z"
  },
  {
    "url": "https://www.internships.com/posting/ccm_dfbc2d80-aa00-4742-80a5-f536b3690bb0",
    "position": "[Video Game] Software Engineering Intern",
    "location": {
      "city": "Remote",
      "state": "",
      "country": ""
    },
    "description": "Software Engineering Intern- Interns are responsible for creating C# code for Unity3d scripts as part of the game development for a game's features or tools. This is a Steam multi-player game and applicants must be advanced Unity3d programmers. Potential interns typically pursue a degree in computer science, computer engineering, or electrical engineering with a strong mathematical background. Candidates should have solid programming C# code. Other desired skills include bit-mapped graphics, 3D graphics, artificial intelligence, and physics. Game development experience is helpful but not required. Candidates should also have strong interpersonal and problem-solving abilities. \n\nJOB RESPONSIBILITIES \n\n• Maintain existing products, debug and apply bug fixes. \n\n• Ability to implement and update gameplay requirements for multiple systems. \n\n• Ability to work with a team, in a fluid, fast-paced work environment. \n\n• Willingness to pitch in when needed to meet the needs of the business. ",
    "company": "Space Dwarves Entertainment LLC.",
    "contact": "",
    "posted": "2 months ago",
    "due": "",
    "lastScraped": "2021-11-11T02:56:31.314Z"
  },
  {
    "url": "https://www.internships.com/posting/3b809f0c-a51e-47fa-8555-87e011bd7de8",
    "position": "Website Developer (WordPress)",
    "location": {
      "city": "Remote",
      "state": "",
      "country": ""
    },
    "description": "Are you interested in computer science? The world of fast-paced tech startups?\n\n\n\n\nWe are looking for one or two coders to help us update our website. Our site is housed at BlueHost on a WP templet. Coders will be working with our Advisory Board for direction and Figma wireframes. This is a fantastic opportunity for any college or high-schooler who wants to gain real-world coding experience as well as learning the behind-the-scenes efforts of a tech startup.\n\n\n\n\nCoders are required to attend full-company meetings on Sunday's at 7:30 pm EST. We also conduct beta testing throughout the week that interns are expected to attend. Although this position is currently only open to high-school and college coders located in the US, please join our waitlist at Admin@SocialTechLabs.com to be notified of any future international opportunities.\n\n\n\n\nWe look forward to reviewing your application! We will reach out to potential applicants to schedule interviews over Chegg.\n\nRequirements\n\n\n",
    "company": "SocialTech Labs, Inc.",
    "contact": "",
    "posted": "a month ago",
    "due": "",
    "lastScraped": "2021-11-11T02:56:37.418Z"
  },
  {
    "url": "https://www.internships.com/posting/45c73358-70e0-4d6c-ae8a-1b1d0a31f26f",
    "position": "Software design and documentation",
    "location": {
      "city": "Remote",
      "state": "",
      "country": ""
    },
    "description": "We have a diversity of technical elements to our solution: mobile apps; Website; payment platforms; analytic tools; integration with email marketing tools; CRM; back-end content management system. We seek the services of a Computer Science student (minimum 3rd year; preferably a 4th year of graduate) who has specific skills in structured software design and documentation. While our various technical elements are modestly documented now, we would engage you to capture all of our component details and map out the full system architecture in data flow and entity relationship diagrams, including ensuring we have appropriate data dictionaries. This would likely happen through three steps:\n\n1) Review existing documtention\n\n2) Look at the code\n\n3) Interview key technical stake-holders to fill in the blanks\n\n\n\n\nNOTE: This will be structured as a project. In other words, we can mutually refine the scope and then price the entire job. Our general expectation is that it should require something like 30 hours of effort.",
    "company": "Nuryl LLC",
    "contact": "",
    "posted": "8 days ago",
    "due": "",
    "lastScraped": "2021-11-11T02:56:43.527Z"
  },
  {
    "url": "https://www.internships.com/posting/98666d14-33a2-4824-b621-d8c5013841c1",
    "position": "Marketing Intern",
    "location": {
      "city": "Remote",
      "state": "",
      "country": ""
    },
    "description": "Are you an expert caption-writer, pop culture fanatic, and #social media aficionado?\n\n\n\n\nOur Los Angeles office is seeking interns who are currently pursuing a bachelor of arts or masters in marketing, computer science, photography, design or other related fields to assist our marketing team. Ideal candidate has experience working with all social platforms, and is ready to think outside of the outside of the box. This opportunity is an unpaid internship and at the completion of the internship, interns must receive school credit.\n\n\n\n\nCurrent Enrollment for: Spring 2022 Program\n\n\n\n\nNOTE: Applications that are not fully and properly filled out will not be considered.\n\n\nRESPONSIBILITIES\nSupport marketing team with client research and initiatives\nIdeate creative concepts, campaigns, and activations for clients\nResearch key competitors in client industries\nCraft and develop content across different social platforms\nAnalyze social growth and make recommendations\nProvide weekly updates to marketing team on industry trends and developments\n\nREQUIREMENTS\nUnusually strong writing skills\nExcellent communication skills\nSerious multitasking skills\nFlexibility and willingness to juggle multiple projects and tasks\nDeep knowledge of Facebook, Twitter, Instagram, Tumblr, and Snapchat\nIncredible attention to detail\nPhotoshop/Adobe Illustrator skills are a major plus, but not required\n\nPERKS\nSignificant opportunity for growth in the company beyond the internship\nWork alongside an incredible slate of clients and team members\nFun, creative and collaborative company culture\nUnlimited Stumptown Cold Brew Coffee\n\n\n\n\nTo qualify, please fully submit your application through Lever: https://jobs.lever.co/brand-knew/bae9a1ec-10a4-48fc-94a5-1b45d964d8f4",
    "company": "Brand Knew",
    "contact": "",
    "posted": "2 months ago",
    "due": "",
    "lastScraped": "2021-11-11T02:56:49.627Z"
  },
  {
    "url": "https://www.internships.com/posting/bug_39105434132",
    "position": "Intern",
    "location": {
      "city": "Honolulu",
      "state": "HI",
      "country": ""
    },
    "description": "Internship HAWAIIAN TELCOM Honolulu, HI JOB DETAILS LOCATION Honolulu, HI POSTED 4 Days Ago Promoted by HAWAIIAN TELCOM Description Job Purpose: The Outside/Inside Plant Engineering Intern will provide support to the Network Development Team. The role will involve drafting schematic, electrical and scale drawings for engineer job plans and specifications. Duties may also include updating databases, developing and updating provisioning sheets, and site walks with an HT engineer to validate poles, pull boxes, utility holes, and addresses. Frequent interaction with Planning and Engineering is required to coordinate related work activities. Performs other related, marginal duties associated with engineering as needed. Essential Functions Assist Engineers with projects while learning the workflow process of day to day engineering. Perform all aspects of technical deployment projects, including an implementation plan, methods of procedures, additional technical resource identification, and execution of work. 50% Develop/modify provisioning sheets, graphs, and charts as required. 10% Assist engineers with reviewing plans, tracking permit submittals, assisting with administrative functions of engineering.10% Update various databases and systems.10% Interact and communicate with planners and engineers when necessary to determine work requirements.10% Perform other related marginal duties as required.10% Qualifications Four years of High School or equivalent Must be enrolled in an Associate's, Bachelor's or Master's degree program in CAD Drafting and Design, Engineering Technology, Computer Science, or Information Sciences with a technical concentration from a two-year college or university. Completion of any one or combination of the following: drafter or architectural, mechanical, or similar drafting courses. Knowledge of TCP/IP and MPLS Networks Microsoft Office Suite: Familiar with all applications from the Microsoft Office Suite to create reports, analyze data, and present information. Ability to learn to utilize new software applications with little/no training and documentation essential. Have a valid driver's license Microsoft Office Ability to quickly learn and utilize new technologies/programming skills 2 or more of the following college course equivalents: UH written communication (FW), UH focus requirement (O, OC), social sciences (DS), or any equivalent Undergraduate students in the following disciplines (major or minor) are preferred: Business Administration, Engineering (any), Computer Science, Communication and Information Sciences, Communications Minimum GPA: 3.0/4.0",
    "company": "",
    "contact": "",
    "posted": "23 days ago",
    "due": "",
    "lastScraped": "2021-11-11T02:56:55.739Z"
  },
  {
    "url": "https://www.internships.com/posting/wup_626629285160222",
    "position": "#TwitterAcademy Internship 2022",
    "location": {
      "city": "",
      "state": "",
      "country": ""
    },
    "description": "Here’s your opportunity to learn, while getting paid! The #TwitterAcademy summer internship program for historically underrepresented (Women, Black, Hispanic/Latinx, and/or Indigenous People) second-year computer science students gives you real, hands-on experience in the tech industry. Selected candidates will participate in interview prep workshops, meet with senior leaders and engage with our #TwitterAcademy alumni on December 8th and will participate in interviews on December 9th & 10th.",
    "company": "",
    "contact": "",
    "posted": "23 days ago",
    "due": "",
    "lastScraped": "2021-11-11T02:57:01.860Z"
  },
  {
    "url": "https://www.internships.com/posting/bug_39090297648",
    "position": "Software Development Intern",
    "location": {
      "city": "Idaho",
      "state": "",
      "country": ""
    },
    "description": "About Clearwater Analytics� Clearwater Analytics� is a global SaaS solution for automated investment data aggregation, reconciliation, accounting, and reporting. Clearwater helps thousands of organizations make the most of investment portfolio data with cloud-native software and client-centric servicing. Every day, investment professionals worldwide trust Clearwater to deliver timely, validated investment data and in-depth reporting. Clearwater aggregates, reconciles, and reports on more than $3 trillion in assets across thousands of accounts daily for our Fortune 500 clients. DESCRIPTION Our Summer internship experience is unique to Clearwater. We'll give you two experienced lead developers who will be your mentors, guides and teachers throughout the summer, as well as access to all our full-time development teams. We treat our interns just like our full-time employees. Within the first week you'll learn and put into practice the methods we use every day to work together effectively to create and build a world-class awesome financial software. Before the end of the summer, you'll have created something with your team to be really proud of. All of that and we pay you a top-notch competitive wage for your field! Responsibilities Strong problem-solving skills Working towards Computer Science or related degree Motivated, team player Someone who isn't afraid to say I don't know, let's figure it out! REQUIREMENTS Current students pursuing a four-year degree in Computer Science, Math, or related What you'll get from us: Opportunity to work for the fastest growing technology firm in Idaho Exposure to new technologies, skills and software tools (Agile development, Java, SQL, front end, back end, everything in between) Opportunity to work on real projects and write code that will be used by our clients and contribute to the company's bottom line The chance to work with CS students from all over the country Pair programming Trainings presented by experienced, full-time developers Great work culture with a driven, low key, work and life balanced environment Flexible work hours (it's the summer, after all. We work hard but we have fun too) Freedom to be creative Intern summer events Competitive wages",
    "company": "",
    "contact": "",
    "posted": "a month ago",
    "due": "",
    "lastScraped": "2021-11-11T02:57:07.978Z"
  },
  {
    "url": "https://www.internships.com/posting/bug_39110007001",
    "position": "2022 Dsp Architecture And Programming Methodology Intern",
    "location": {
      "city": "Georgia",
      "state": "",
      "country": ""
    },
    "description": "2022 DSP Architecture and Programming Methodology Intern Woburn, Massachusetts - USD Full Time Posted by: MediaTek Posted: Saturday, 23 October 2021 Apply There is a lot that goes on behind the scenes when you surf the web on your smartphone - and even more that goes on when the (huge!) chip at the heart of the system is designed and implemented. Come and be a part of the Mediatek modem team and learn what we do. You will make real contributions to next-generation 5G wireless products that will be used by millions of people! The team in Woburn MA seeks motivated PhD or MS candidates in the area of automation, architectural evaluation, algorithm-to-firmware development methodology, and programming languages and tools, for multi-core vector processor used in software-defined radio (SDR) wireless systems. During your internship, you can work on one of several projects, including: Using techniques and ideas from approximate computing to reduce modem area and energy consumption while maintaining acceptable signal quality and cycle performance Using simulation and/or analytic techniques to determine whether the modem hardware and firmware is sufficiently well verified Exploring new approaches to high-performance simulation and verification of multicore processor systems Efficiency analysis of hardware and firmware verification. We spend enormous time and resources to verify our models and firmware - and it would be nice to figure out where we could improve: either do better verification with the same resource and time (fewer escaped bugs), or same verification with far less resource (especially human time/manual effort). or propose your own project that we would find interesting! The ideal candidate will have a background in one or more of the areas outlined above, and will have very strong C++ and Python implementation skills. Qualifications: PhD/MS candidate in electrical/computer engineering, computer science or related field Passion for programming languages, computer architecture and/or code optimization. Excellent programming skills C/C++ required, Python is helpful Experience with automated analysis and CI/CD systems is also helpful Experience with assembly language is a plus Problem solving and analysis skills Expertise in processor architecture or instruction sets are pluses Wireless background is a plus Location Woburn, Massachusetts, United States of America Industry IT Rate USD Employment Agency MediaTek Contact MediaTek Reference JS1370522003 Posted Date 10/23/2021 6:16:33 PM Permalink http://www.jobshark.com/NqyS4 Apply We strongly recommend that you should never provide your bank account details to an advertiser during the job application process. Should you receive a request of this nature please contact support giving the advertiser's name and job reference.",
    "company": "",
    "contact": "",
    "posted": "15 days ago",
    "due": "",
    "lastScraped": "2021-11-11T02:57:14.085Z"
  },
  {
    "url": "https://www.internships.com/posting/bug_39110007032",
    "position": "2022 Dsp Architecture And Programming Methodology Intern",
    "location": {
      "city": "North Carolina",
      "state": "",
      "country": ""
    },
    "description": "2022 DSP Architecture and Programming Methodology Intern Woburn, Massachusetts - USD Full Time Posted by: MediaTek Posted: Saturday, 23 October 2021 Apply There is a lot that goes on behind the scenes when you surf the web on your smartphone - and even more that goes on when the (huge!) chip at the heart of the system is designed and implemented. Come and be a part of the Mediatek modem team and learn what we do. You will make real contributions to next-generation 5G wireless products that will be used by millions of people! The team in Woburn MA seeks motivated PhD or MS candidates in the area of automation, architectural evaluation, algorithm-to-firmware development methodology, and programming languages and tools, for multi-core vector processor used in software-defined radio (SDR) wireless systems. During your internship, you can work on one of several projects, including: Using techniques and ideas from approximate computing to reduce modem area and energy consumption while maintaining acceptable signal quality and cycle performance Using simulation and/or analytic techniques to determine whether the modem hardware and firmware is sufficiently well verified Exploring new approaches to high-performance simulation and verification of multicore processor systems Efficiency analysis of hardware and firmware verification. We spend enormous time and resources to verify our models and firmware - and it would be nice to figure out where we could improve: either do better verification with the same resource and time (fewer escaped bugs), or same verification with far less resource (especially human time/manual effort). or propose your own project that we would find interesting! The ideal candidate will have a background in one or more of the areas outlined above, and will have very strong C++ and Python implementation skills. Qualifications: PhD/MS candidate in electrical/computer engineering, computer science or related field Passion for programming languages, computer architecture and/or code optimization. Excellent programming skills C/C++ required, Python is helpful Experience with automated analysis and CI/CD systems is also helpful Experience with assembly language is a plus Problem solving and analysis skills Expertise in processor architecture or instruction sets are pluses Wireless background is a plus Location Woburn, Massachusetts, United States of America Industry IT Rate USD Employment Agency MediaTek Contact MediaTek Reference JS1370522003 Posted Date 10/23/2021 6:16:33 PM Permalink http://www.jobshark.com/NqyS4 Apply We strongly recommend that you should never provide your bank account details to an advertiser during the job application process. Should you receive a request of this nature please contact support giving the advertiser's name and job reference.",
    "company": "",
    "contact": "",
    "posted": "15 days ago",
    "due": "",
    "lastScraped": "2021-11-11T02:57:20.190Z"
  },
  {
    "url": "https://www.internships.com/posting/bug_39090298011",
    "position": "Security Engineer Intern Summer",
    "location": {
      "city": "North Carolina",
      "state": "",
      "country": ""
    },
    "description": "Every day, Pendo's flagship analytics platform processes over 10.5 billion events and creates over 225,000 data analytics results. Every hour we ingest over 100+ million web and mobile events. Then in a fraction of a second we query hundreds of terabytes (or more) of data in order to respond to our users' actionsallowing users to discover valuable insights about their products. Pendo is looking for a dynamic, motivated, and self-driven individual to join our Information Security team this summer as a Security Engineer Intern! Are you passionate about cybersecurity and helping to protect complex cloud-based applications that serve millions of users? If this interests you, this role is for you! We are looking for a Computer Science major (or other technical discipline) interested in working in a fast-paced, rapidly growing tech environment with a complex SaaS application that faces millions of people. In addition to the day-to-day responsibilities this intern will hold, you'll also be provided mentorship and development via one-on-one time with our Chief Information Security Officer and other members of our Information Security team. Responsibilities (what you'll do): Participate as a member of the Information Security team on assigned operational and project-based tasks. Work will be varied and may include the following types of activities: Running and analyzing the results from vulnerability scans Developing scripts to help automate security tasks Reviewing and updating documentation for security policies and procedures Assessing risks and making recommendations for addressing them Educating Pendo staff on security threats, policies, and procedures Assisting with developing threat models for new services and product features Assisting with identifying and responding to potential cyber attacks Qualifications (what you have): Pursuing a degree in Computer Science or other technical discipline. Demonstrated experience, either through coursework, previous work, or self-study, in one or more of the following areas: Scripting and coding to automate systems and security administration tasks (e.g. using a language such as Python) Identifying, assessing, and remediating security vulnerabilities in web applications Securing cloud computing services (SaaS, PaaS, and IaaS) Evaluating risks associated with using third party services Creating and delivering security awareness training Excellent communication and presentation skills. Strong critical thinking and time management capabilities. A passion for learning and a customer-focused mindset. Pendo Description: Pendo was founded in 2013 by former product managers, who combined their heads and hearts to build something they wanted but never had as product managers -- a simple way to understand and attack what truly drives product success. Our mission is to improve society's experience with software. Come join one of the fastest-growing startups, supported by best-in-class institutions like Battery Ventures, Salesforce Ventures, Spark Capital and Meritech. You will gain experience in a diverse and exciting set of technologies and clients and have a real impact on Pendo's future. Our culture is passionate, dynamic, and fun. EEOC We are an equal opportunity employer and believe having diverse teams where everyone brings their whole self to Pendo is key to our success. We welcome all people of different backgrounds, experiences, abilities and perspectives. Accessibility Pendo is committed to working with, and providing access and reasonable accommodation to, applicants with mental and/or physical disabilities. If you think you may require an accommodation for any part of the recruitment process, please send a request to: accommodation@pendo.io. All requests for accommodations are treated discreetly and confidentially, as practical and permitted by law.",
    "company": "",
    "contact": "",
    "posted": "a month ago",
    "due": "",
    "lastScraped": "2021-11-11T02:57:26.281Z"
  },
  {
    "url": "https://www.internships.com/posting/bug_39109956465",
    "position": "Intern - Smart Manufacturing And Ai Data Science",
    "location": {
      "city": "Idaho",
      "state": "",
      "country": ""
    },
    "description": "Our vision is to transform how the world uses information to enrich life for all. Join an inclusive team passionate about one thing: using their expertise in the relentless pursuit of innovation for customers and partners. The solutions we build help make everything from virtual reality experiences to breakthroughs in neural networks possible. We do it all while committing to integrity, sustainability, and giving back to our communities. Because doing so can fuel the very innovation we are pursuing. Micron's vision is to transform how the world uses information to enrich life for all. Join an inclusive team focused on one thing: using our expertise in the relentless pursuit of innovation for customers and partners. The solutions we create help make everything from virtual reality experiences to breakthroughs in neural networks possible. We do it all while committing to integrity, sustainability, and giving back to our communities. Because doing so can spark the very innovation we are pursuing. As a Data Science Intern at Micron Technology Inc., you will research and employ techniques and theories drawn from areas of mathematics, statistics, and information technology to uncover patterns in data from which predictive models, actionable insights, and solutions can be developed. This will involve one or more of the following methods or subjects: signal processing, image analytics, probability models, machine learning, statistical learning, computer programming, data engineering, pattern recognition and learning, visualization, uncertainty modeling, Big Data, and high-performance computing. You will interact with Data Scientists and engineering teams to identify questions and issues for data analysis projects. In this position, you will help develop and code software programs, algorithms and/or automated processes to cleanse, integrate, evaluate, and/or model datasets from multiple disparate sources. Qualifications Desire to work on data analysis projects that will improve yield, quality, reduce costs and cycle time, and/or optimize business processes. Ability to extract data from different databases via SQL and other query languages and applying data cleansing, outlier identification, and missing data techniques. Ability to work with small, big, structured, semi-structured, and unstructured data. Experience with or desire to learn: Python, R, JMP, and/or other statistical software including scripting capability for automating analyses, Machine learning and other advanced analytical methods, Hadoop and/or Snowflake, and Education Requirements: A B.Sc. degree in statistics, physics, computer science, engineering, applied mathematics, etc. with the intentions of completing a MS or Ph.D. in one of these fields. 6 to 12 month internship. Preferred start date Jan. 2022 or May. 2022 About Micron Technology, Inc. We are an industry leader in innovative memory and storage solutions transforming how the world uses information to enrich life for all . With a relentless focus on our customers, technology leadership, and manufacturing and operational excellence, Micron delivers a rich portfolio of high-performance DRAM, NAND, and NOR memory and storage products through our Micron� and Crucial� brands. Every day, the innovations that our people create fuel the data economy, enabling advances in artificial intelligence and 5G applications that unleash opportunities from the data center to the intelligent edge and across the client and mobile user experience. To learn more, please visit micron.com/careers Micron is proud to be an equal opportunity workplace and is an affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, age, national origin, disability, protected veteran status, gender identity or any other factor protected by applicable federal, state, or local laws. Please note that in order to assist in providing a safe and healthy workplace for all Micron team members, new employment offers for jobs based in the U.S., Singapore and Malaysia are contingent upon the applicant's provision of a copy of their COVID-19 vaccination document to Micron on a confidential basis prior to their scheduled start date confirming that they have completed the COVID-19 vaccination process, subject to any written request for medical or religious accommodation and to the extent permitted by applicable law. For US Sites Only: To request assistance with the application process and/or for reasonable accommodations, please contact Micron's People Organization at hrsupport_na@micron.com or 1-800-336-8918 Micron Prohibits the use of child labor and complies with all applicable laws, rules, regulations, and other international and industry labor standards. Micron does not charge candidates any recruitment fees or unlawfully collect any other payment from candidates as consideration for their employment with Micron.",
    "company": "",
    "contact": "",
    "posted": "15 days ago",
    "due": "",
    "lastScraped": "2021-11-11T02:57:32.386Z"
  },
  {
    "url": "https://www.internships.com/posting/bug_39101673868",
    "position": "Software Engineer Intern",
    "location": {
      "city": "North Carolina",
      "state": "",
      "country": ""
    },
    "description": "BASIC FUNCTIONS: This entry-level position performs basic software development assignments within a specific software functional area or product line. QUALIFICATIONS: * BS Engineering/Computer Science or equivalent experience required TECHNICAL SKILLS: * Basic knowledge of software development methodologies (e.g., Agile, Waterfall). * Basic knowledge of data manipulation languages. * Basic understanding of data modeling principles. * Knowledge of data storage subsystems. * Basic knowledge of applicable development languages including but not limited to: Java/J2EE, .Net, Angular, JavaScript, JSP, HTML, XML, SQL, Windows, and Linux. * Knowledge of test-driven development. * Ability and desire to learn new processes and technologies. * Basic oral and written communications skills. ACCOUNTABILITIES: * Write and review portions of detailed specifications for the development of system components of simple complexity. * Complete simple bug fixes. * Under the guidance of senior-level engineers, successfully implement development processes, coding best practices and code reviews. * Operate in various development environments (Agile, Waterfall, etc.) while collaborating with key stakeholders. * Resolve basic technical issues as necessary. * Keep abreast of new technology developments. * All other duties as assigned. LexisNexis, a division of RELX Group, is an equal opportunity employer: qualified applicants are considered for and treated during employment without regard to race, color, creed, religion, sex, national origin, citizenship status, disability status, protected veteran status, age, marital status, sexual orientation, gender identity, genetic information, or any other characteristic protected by law. If a qualified individual with a disability or disabled veteran needs a reasonable accommodation to use or access our online system, that individual should please contact accommodations@relx.com or if you are based in the US you may also contact us on 1.855.833.5120. Please read our Candidate Privacy Policy",
    "company": "",
    "contact": "",
    "posted": "a month ago",
    "due": "",
    "lastScraped": "2021-11-11T02:57:38.500Z"
  },
  {
    "url": "https://www.internships.com/posting/bug_39106272231",
    "position": "Intern, Data Engineer",
    "location": {
      "city": "Texas",
      "state": "",
      "country": ""
    },
    "description": "Intern, Data Engineer The Job Details are as follows: Overview: We are looking for creative and enthusiastic Data Engineers to join our team in building the best Data Platform on the street. Were responsible for managing the flow of data into the firm, maintaining the data lake, creating analytics-ready datasets, and building the APIs that make everything accessible to our clients. Our singular goal is to help our investment teams use data to make better investment decisions. Our analysts and systematic trading teams rely on us to provide analytics-ready datasets. For each dataset we must consider the implications of point in time storage, optimize for our users access patterns, and create useful aggregations/slices. Our ideal candidate will have experience with storing, transforming, and modeling big data. In this role, you will be exposed to: * Developing cloud-first data ingestion processes using Python, SQL, and Spark * Engineering data models and infrastructure for a wide variety of market and alternative datasets * Designing and building services and plugins to enhance our Data Platform * Maintaining alerting systems to ensure smooth day-to-day operations for hundreds of datasets * Authoring tests to validate data quality and the stability of the platform * Investigating and defusing time-sensitive data incidents * Communicating with data providers to onboard new datasets and troubleshoot technical issues * Evangelizing best practices to our partners throughout the firm What Youll Bring: * A love of data and a passion for engineering * A thousand questions and a drive to exceed expectations * Candidacy for Bachelors/Masters degree in Computer Science, Data Analytics, or a related field * Strong analytical, data, and programming skills (Python/SQL/NoSQL) * Strong oral and written communication skills, most importantly, must be a team player",
    "company": "",
    "contact": "",
    "posted": "21 days ago",
    "due": "",
    "lastScraped": "2021-11-11T02:57:44.590Z"
  }
]