[
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Full-Stack-Engineer-Summer-2022-Internship-Bachelors-Meraki/1353180",
    "position": "Full Stack Engineer Summer 2022 Internship, Bachelors (Meraki)",
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": "Summer Internship (May - August 2022), full-time work schedule, Monday- Friday 40 hours per week\n\nCisco Meraki Business Unit\n\nThe modern world runs on the Internet, and the Internet cannot exist without its underlying infrastructure. Meraki makes setting up, managing, and maintaining that infrastructure easier than it has ever been before. Meraki enables connectivity everywhere from neighborhood cafes to education institutions to global hospitality groups operating thousands of sites.\n\nAs a Full Stack Engineer at Meraki, you will help craft and build features for Meraki's Dashboard - the window to the entire Meraki experience. From Dashboard, our customers can control their entire Meraki stack: access points, switches, firewalls, client devices, cameras, and more. You will work across the stack with other developers, UX designers, and product management to build and improve the Dashboard web application. Meraki engineers put the customer experience first, own projects from beginning to end, and are empowered to make impactful decisions.\n\nMeraki believes that the quality of our product is dependent on the quality of our engineers. We place a high value on nurturing the growth and development of everyone on our team. We foster an open and supportive workplace where everybody is given the opportunity to succeed.\n\nExample projects of a Full Stack Web Developer Intern:\nCreate services to fetch data from millions of Meraki devices, then present that data in a user-friendly way\nImprove performance and efficiency of our backend, allowing us to handle increasingly large datasets with minimal delay\nBuild internal frameworks and refine front end infrastructure to augment developer productivity\nConstruct API endpoints to allow Meraki users and third party companies to build custom tools and features\nBuild a dashboard for anomaly / outlier detection on network traffic using machine learning algorithms\nBuild a graph for network traffic analysis using clustering and other algorithms\nYou are an outstanding applicant if:\nYou are pursuing a technical bachelors degree or have equivalent experience with a strong foundation in the fundamentals of computer science\nYou strive to build rich and dynamic web applications with front-end frameworks such as React, Redux, Ember, or Angular\nYou are familiar with programming languages and web frameworks like Ruby (Rails, EventMachine), Python (Django, Flask), or Node.js (Express)\nYou have worked with SQL and relational Databases\nYou would flourish within a small engineering team and are excited to tackle open-ended problems\nIntern Program Overview:\n\nMeraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto subteams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the majority of the program on a larger project, such as building the infrastructure for a new service. Projects are cross functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program.  Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\nIntern Benefits:\n\nHousing Assistance\n\nCompetitive salary\n\nWeekly social events inside and outside of the office (Giants games, Exploratorium tickets, friendly soccer games)\n\nLunch and dinner daily\n\nCustomized laptop and desk setups\n\nMedical coverage plan\n\nCisco requires all U.S. employees to be fully vaccinated or have an approved religious or medical accommodation. Candidates accepting an offer must provide proof of vaccination status on their first day. If someone anticipates requesting an accommodation for this requirement, they must receive approval before the start date. Candidates receiving an offer will receive additional information about the accommodation process at the time of the offer. All offers of employment are contingent upon complying with Cisco's vaccination policy.\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-12-06T18:32:49.102Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Product-Management-Intern-MBA-Summer-2022-Internship-Meraki/1349331",
    "position": "Product Management Intern, MBA - Summer 2022 Internship (Meraki)",
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": "Product Management Internship, Summer 2022 (May - August) in San Francisco. \n\nThe modern world runs on the Internet, and the Internet cannot exist without its underlying infrastructure. Meraki makes setting up, managing, and maintaining that infrastructure easier than it has ever been before. Meraki enables connectivity everywhere from neighborhood cafes to education institutions to global hospitality groups operating thousands of sites.\n\nAs a Product Management Intern at Meraki, you will collaborate with forward-thinking engineers and excited customers to help ensure that we have another homerun product addition to the Meraki #fullstack. You will work closely with the executive team to establish a winning strategy, and collaborate with our extraordinary sales, marketing, and partner teams to ensure market-adoption and rapid growth. We want your help to make this nascent product line shake up the burgeoning multi-billion-dollar analytics market.\n\nMeraki believes that the quality of our product is dependent on the quality of our engineers. We place a high value on nurturing the growth and development of everyone on our team. We foster an open and encouraging workplace where everybody is given the opportunity to succeed.\n\nExample projects of a Product Management Intern:\n\nWorking closely with the customer and our engineering team to identify new product concepts and GTM strategies.\nDevelop new MX product for service provider customers, working with sales, marketing, hardware, and software engineering teams\n\nYou are an outstanding applicant if:\n\nStrong business background (ex: MBA, Product Management or Marketing) desired\nCCNA/CCNP/CCIE routing/switching/security certifications a plus\nExperience with or passion for learning about networking, cloud, and emerging disruptive technologies\nStrong user empathy with a deep desire to understand top customer problems\nEasily communicate complicated concepts to non-technical folks\nEntrepreneurial, can-do attitude with a strong sense of product quality\nLove solving technical problems in creative ways\n\nIntern Program Overview:\n\nMeraki interns join the team for a 12 or14 week program and are placed directly onto subteams. During the program, interns have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the remaining duration of the program on a larger project, such as building the infrastructure for a new service. Projects are cross-functional, which allow insight into new languages and technologies, help encourage professional growth within engineering and allow a sense of ownership within the team.\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program. Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\nCisco requires all U.S. employees to be fully vaccinated or have an approved religious or medical accommodation. Candidates accepting an offer must provide proof of vaccination status on their first day. If someone anticipates requesting an accommodation for this requirement, they must receive approval before the start date. Candidates receiving an offer will receive additional information about the accommodation process at the time of the offer. All offers of employment are contingent upon complying with Cisco's vaccination policy.\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-12-06T18:32:49.102Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Test-Automation-Engineer-Summer-2022-Internship-Bachelors-Meraki/1348849",
    "position": "Test Automation Engineer Summer 2022 Internship, Bachelors (Meraki)",
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": "Summer Internship (May 2022 - August, full-time work schedule, Monday- Friday 40 hours per week)\n\nCisco Meraki Business Unit\n\nSimplicity. Meraki makes setting up, managing, and maintaining networks easier than it has ever been before. Simplified and smarter networking means that businesses run more efficiently, and more people have reliable access to the information they need. Meraki enables connectivity everywhere from neighborhood cafes to education institutions to global hospitality groups operating thousands of sites.\n\nYou will join a test automation team that is fully embedded within our software engineering team. We handle all types of testing projects for our cloud managed products; from nightly feature tests across the latest firmware images to performance testing of all kinds. We run large scale testing to measure how small changes could impact our performance. Our automation framework is being used across software engineering, and we continue to make it more intuitive. Our products are used in over a million networks and our customers rely on our products to serve ten of millions of people. With the large footprint that we have, quality is our highest priority. We are looking for the newest additions to our teams who are as passionate about quality as we are. Meraki engineers put the customer experience first, own projects from beginning to end, and are empowered to make impactful decisions. Your contributions will make direct impact to the success of our business.\n\nMeraki believes that the quality of our product is dependent on the quality of our engineers. We place a high value on nurturing the growth and development of everyone on our team. We foster an open and encouraging workplace where everybody is given the opportunity to succeed.\n\nA day in the life of Test Automation Engineering Intern:\n\nYou may design a testbed from the ground up that has the ability to change topologies on the fly. You will have an in-house automation framework at your disposal as well as APIs to hook into for further automation. You will have the autonomy to craft and implement a solution as well as the knowledge and experience of team members to help you along the way.\n\nIn addition to software testing, you may have a chance to work on our latest hardware appliances from an early phase of development. You will get to learn some of the cool technologies inside the box. Through testing, you will gain firsthand knowledge about the performance and be able to guide the team in improving the quality before we release the product.\n\nWhat does it take?\nYou are pursuing a bachelors technical degree or equivalent experience with a great foundation in the fundamentals of computer science and computer networking\nYou are proficient in scripting languages such as Ruby or Python\nYou are proficient in Lunix and REST API\nYou have solid understanding of core network protocols like TCP/IP, DHCP, DNS, VLANS, etc.\nYou have experience in performance testing\nYou have CCNA or equivalent certification\nYou have familiarity with UI framework such as React/Ember/Angular\nYou have familiarity with IPv6 and routing protocols like OSPF and BGP\nYou have worked with virtualization or container technology, such as ESXi, Xen, Docker, etc.\nYou have used development infrastructure tools such as Jenkins, Git, Gerrit, and JIRA and/or have experience with Database solutions (e.g, InfluxDB, PostgreSQL, etc)\nIntern Program Overview:\n\nMeraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto sub-teams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the bulk of the program on a larger project, such as building the infrastructure for a new service. Projects are multi-functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program. Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\nIntern Benefits:\nHousing assistance in San Francisco for duration of program\nCompetitive salary\nWeekly social events inside and outside of the office (Giants games, Exploratorium tickets, friendly soccer games)\nLunch and dinner daily\nCustomized laptop and desk setups\nMedical coverage plans\n\nCisco requires all U.S. employees to be fully vaccinated or have an approved religious or medical accommodation. Candidates accepting an offer must provide proof of vaccination status on their first day. If someone anticipates requesting an accommodation for this requirement, they must receive approval before the start date. Candidates receiving an offer will receive additional information about the accommodation process at the time of the offer. All offers of employment are contingent upon complying with Cisco's vaccination policy.\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-12-06T18:32:49.102Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Site-Reliability-Engineer-Summer-2022-Internship-Bachelors-Meraki/1341219",
    "position": "Site Reliability Engineer Summer 2022 Internship, Bachelors (Meraki)",
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": "Site Reliability Engineer\n\nSummer Internship (May- August), full-time work schedule, Monday - Friday / 40 hours)\n\nCisco Meraki Business Unit\n\nAs a Site Reliability Engineer Intern/Co-op on the Meraki Backend Infrastructure Team, you will work on projects responsible for everything from our server hardware and operating systems to tools for code deployment and service monitoring. You will have the opportunity to build software and systems to monitor, scale and deploy our distributed cloud services.\n\nMeraki's Backend Infrastructure Team is responsible for building and scaling the cloud that supports millions of Meraki devices across the world. Meraki’s customer base has grown by a factor of 2-3 every year, serving more than 1.5 billion HTTP requests per day across six data centers. Our customers depend on the Meraki cloud to manage and monitor their critical infrastructure of network switches, security appliances, wireless APs, security cameras, and phones.\n\nIn this role, you will be part of a small engineering team that is based out of Meraki’s San Francisco headquarters. During your time here, you will make crucial decisions about how to manage and scale complex, high-performance distributed systems. You will also provide your own perspective on our backend systems and help develop innovative ways to improve the way we manage the underlying infrastructure.\n\nWhat we look for in our SRE intern/co-op candidates:\n\nJunior/Senior status pursuing a BA/BS in Computer Science, ECE, EE, ME or STEM related field (in progress), no masters\nClear and effective communication skills\nProactive learners who can quickly pick up working in multiple frameworks, languages and environments\nPassionate team players\nContinually able to learn from experience and eager for feedback\nPrevious internship or large scale project experience\nA strong foundation in the fundamentals of Computer Science (familiarity with networking, data visualization, Ruby on Rails, C/C++ or an understanding of databases)\n \nBonus Points:\nKnow your way around *nix systems. We run Debian.\nAre familiar with logging and monitoring tools such as Graphite, Grafana, Logstash, ElasticSearch, statsd, collectd.\n\nProjects and Work Life:\n\nMeraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto subteams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the majority of the program on a larger project, such as building the infrastructure for a new service. Projects are cross functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program.  Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\nExamples of Past Projects\n\nAdding at-rest encryption to our cloud-based database backups\nRevamping our Organization Move process to move customers between servers\nImplementing Docker Containers to move our infrastructure to a containerized world\n\nIntern Benefits:\n\nHousing Assistance \nCompetitive salary\nWeekly social events inside and outside of the office (Giants games, Exploratorium tickets,    friendly soccer games)\nLunch and dinner daily\nCustomized laptop and desk setups\nMedical, dental, and vision coverage plans\n\nCisco requires all U.S. employees to be fully vaccinated or have an approved religious or medical accommodation. Candidates accepting an offer must provide proof of vaccination status on their first day. If someone anticipates requesting an accommodation for this requirement, they must receive approval before the start date. Candidates receiving an offer will receive additional information about the accommodation process at the time of the offer. All offers of employment are contingent upon complying with Cisco's vaccination policy.\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-12-06T18:32:49.102Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Network-Support-Engineer-Intern-San-Francisco-Summer-2022-Internship-Bachelors-Meraki/1341029",
    "position": "Network Support Engineer Intern - San Francisco, Summer 2022 Internship, Bachelors (Meraki)",
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": "Summer Internship (May-August, full-time, San Francisco)\n\nCisco Meraki Business Unit\n\nAt Cisco Meraki, our Network Support Engineer Interns act as key players on the Support team! You will troubleshoot cases that cover the entire Meraki product line, including our wireless access points, security appliances, switches, and Systems Manager application, just like our full-time engineers. With a steep learning curve and a fun, challenging work environment, our interns come out of the program with a deeper understanding of networking, stronger problem-solving skills, and a mastery of customer support that will carry with them for the rest of their careers. Our interns are an integral part of the Support team - we look for smart, passionate individuals who are open to taking on any task and are proactive in helping the team. The position is full-time and based out of the San Francisco office. \n\nResponsibilities\n\nResearch and resolve issues reported by Meraki customers and partners\nIdentify issues suitable for entry in the Meraki Knowledge Base\nWrite, review, and release KB articles\nAssist with lab testing work as needed for Meraki products\nIdentify, reproduce, and document bugs\nHave a project in mind? Let us know and we'll help to make it happen!\n\nQualifications\n\nMust be a Junior or Senior working towards a B.S in Networking and Systems Administration, Computer Information Technology, Network Technologies, Computer Science, or a related discipline from an accredited university - Not accepting Masters students\nBasic understanding of networking fundamentals, e.g. be able to explain the functions of and differences among the link, network, transport, and application layers\nA passion to assist and problem-solve with our customers\nOutstanding account management, follow-through, and problem-solving skills\nResourcefulness and attention to detail\nExcellent communication skills, both written and verbal\n\nCisco requires all U.S. employees to be fully vaccinated or have an approved religious or medical accommodation. Candidates accepting an offer must provide proof of vaccination status on their first day. If someone anticipates requesting an accommodation for this requirement, they must receive approval before the start date. Candidates receiving an offer will receive additional information about the accommodation process at the time of the offer. All offers of employment are contingent upon complying with Cisco's vaccination policy.\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-12-06T18:32:49.102Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Network-Support-Engineer-Intern-Helpdesk-IT-Computer-Science-Summer-2022-Internship-Meraki/1340044",
    "position": "Network Support Engineer Intern (Helpdesk, IT, Computer Science) - Summer 2022 Internship (Meraki)",
    "location": {
      "city": "Chicago",
      "state": "Illinois",
      "country": ""
    },
    "description": "Summer Internship (May - August 2022, full-time) in Chicago, IL or San Francisco, CA\n\nCisco Meraki Business Unit\n\nAt Cisco Meraki, our Network Support Engineering team troubleshoots cases that cover the entire Meraki product line, including our wireless access points, security appliances, cameras, switches, and Systems Manager application!\n\nThe Network Support Internship allows individuals to explore the wonders of Networking by rapidly developing an understanding of networking fundamentals through structured classroom instruction, Packet Tracer exposure, labs, and troubleshooting scenarios instructed by a Meraki Intern Instructor/Mentor.\n\nWith a steep learning curve and a fun, challenging work environment, our interns come out of the program with a deeper understanding of networking, stronger problem-solving skills, and a mastery of customer support.\n\nYou will…\n\nParticipate in and successfully complete structured classroom workshops specific to core CCNA preparation administered by a Meraki instructor\nWork through lab assignments via Packet Tracer, NetAcad labs, and Meraki troubleshooting labs to learn the fundamentals of networking and troubleshooting\nGain an understanding of the networking field by participating and engaging in various courses\nAssist with lab testing work as needed for Meraki products\nIdentify issues suitable for entry in the Meraki Knowledge Base\nGain exposure to researching and resolving issues reported by Meraki customers and partners\n\nYou are….\n\nJunior or senior pursuing a bachelor's degree with a computer science, information technology, networking, systems administration, or a related field from an accredited university. Individuals already graduated or pursuing a master’s degree will not be considered\nHardworking and interested in exploring the Networking field\nPassionate to assist and problem-solve with customers\nAble to strategically and critically think about how to look for solutions, willing to be pushed outside your knowledge areas, and eager to learn and find solutions\nA strong communicator and problem-solver\nAuthorized to work in the U.S. without requiring sponsorship now or in the future\n\nPreferred experiences within helpdesk, technical call center, desktop support, or past networking experiences preferred, but not required. \n\nCisco requires all U.S. employees to be fully vaccinated or have an approved religious or medical accommodation. Candidates accepting an offer must provide proof of vaccination status on their first day. If someone anticipates requesting an accommodation for this requirement, they must receive approval before the start date. Candidates receiving an offer will receive additional information about the accommodation process at the time of the offer. All offers of employment are contingent upon complying with Cisco's vaccination policy.\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-12-06T18:32:49.102Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Network-Support-Engineer-Intern-Chicago-Summer-2022-Internship-Bachelors-Meraki/1339621",
    "position": "Network Support Engineer Intern - Chicago, Summer 2022 Internship, Bachelors (Meraki)",
    "location": {
      "city": "Chicago",
      "state": "Illinois",
      "country": ""
    },
    "description": "Summer Internship (May-August, full-time, Chicago)\n\nCisco Meraki Business Unit\n\nAt Cisco Meraki, our Network Support Engineer Interns act as key players on the Support team! You will troubleshoot cases that cover the entire Meraki product line, including our wireless access points, security appliances, switches, and Systems Manager application, just like our full-time engineers. With a steep learning curve and a fun, challenging work environment, our interns come out of the program with a deeper understanding of networking, stronger problem-solving skills, and a mastery of customer support that will carry with them for the rest of their careers. Our interns are an integral part of the Support team - we look for smart, passionate individuals who are open to taking on any task and are proactive in helping the team. The position is full-time and based out of the Chicago office. \n\nResponsibilities\n\nResearch and resolve issues reported by Meraki customers and partners\nIdentify issues suitable for entry in the Meraki Knowledge Base\nWrite, review, and release KB articles\nAssist with lab testing work as needed for Meraki products\nIdentify, reproduce, and document bugs\nHave a project in mind? Let us know and we'll help to make it happen!\n\nQualifications\n\nMust be a Junior or Senior working towards a B.S in Networking and Systems Administration, Computer Information Technology, Network Technologies, Computer Science, or a related discipline from an accredited university - Not accepting Masters students\nBasic understanding of networking fundamentals, e.g. be able to explain the functions of and differences among the link, network, transport, and application layers\nA passion to assist and problem-solve with our customers\nOutstanding account management, follow-through, and problem-solving skills\nResourcefulness and attention to detail\nExcellent communication skills, both written and verbal\n\nCisco requires all U.S. employees to be fully vaccinated or have an approved religious or medical accommodation. Candidates accepting an offer must provide proof of vaccination status on their first day. If someone anticipates requesting an accommodation for this requirement, they must receive approval before the start date. Candidates receiving an offer will receive additional information about the accommodation process at the time of the offer. All offers of employment are contingent upon complying with Cisco's vaccination policy.\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-12-06T18:32:49.102Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Product-Software-Engineer-Summer-2022-Internship-Meraki/1339636",
    "position": "Product Software Engineer Summer 2022 Internship (Meraki)",
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": "Product Software Engineer\n\nSummer Internship (May - August 2022, full-time work schedule, Monday- Friday 40 hours per week)\n\nThe modern world runs on the Internet, and the Internet cannot exist without its underlying infrastructure. Meraki makes setting up, managing, and maintaining that infrastructure easier than it has ever been before. Meraki enables connectivity everywhere from neighborhood cafes to elite universities to global hospitality groups operating thousands of sites.\n\nAs a Product Software Engineer at Meraki, you will bring life to our products, imbuing them with what some call the Meraki Magic. Through your contributions, you will enable our customers to do more things more easily than ever before. You will have opportunities to work across our stack, developing software ranging from bootloaders, device drivers, and routing code to our distributed, cloud-hosted backend.\n\nHere are some of the projects you might find yourself working on:\n\nDesigning and implementing (usually in C/C++) features to improve the reliability, simplicity, and performance of our devices, as well as make them more flexible and powerful\nBringing up our Linux-based system on new hardware platforms\nCollaborating with our hardware engineers on the design of new platforms\nYou’re the kind of person we’re looking for if:\nBA/BS in Computer Science, ECE, EE, ME or STEM related field (in progress)\nYou are comfortable writing systems-level C/C++ (or if you’ve written your own OS!)\nYou have familiarity developing and implementing computer networking fundamentals (TCP/IP, routing protocols, IPv6, etc.)\nYou have worked with Linux on embedded platforms\nYou have an understanding of OS fundamentals and experience working in both kernel and user space\nYou love being a part of a tight-knit, hard-working team and want to have an impact with your own work while also elevating your teammates\nYou have previous internship or large project experience\n\nAs a software engineer early in your career, you may still be identifying areas that you are curious about or in which would like to develop more depth. At Meraki, you will have the opportunity to explore multiple technology areas and problem domains. Whether you have a passion for user interfaces, distributed systems, network protocols, or embedded development — or perhaps more than one of these — you will be able to dive deep here. Together with your team you will craft from top to bottom the suite of innovative products that make Meraki unique.\n\nIntern Program Overview:\n\nMeraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto subteams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the bulk of the program on a larger project, such as building the infrastructure for a new service. Projects are multi-functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program. Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\nIntern Benefits:\nHousing Assistance\nCompetitive salary\nWeekly social events inside and outside of the office (Giants games, Exploratorium tickets, friendly soccer games)\nLunch and dinner daily\nCustomized laptop and desk setups\nMedical coverage plans\n\nCisco requires all U.S. employees to be fully vaccinated or have an approved religious or medical accommodation. Candidates accepting an offer must provide proof of vaccination status on their first day. If someone anticipates requesting an accommodation for this requirement, they must receive approval before the start date. Candidates receiving an offer will receive additional information about the accommodation process at the time of the offer. All offers of employment are contingent upon complying with Cisco's vaccination policy.\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-12-06T18:32:49.102Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Product-Manager-MBA-Intern-United-States/1338244",
    "position": "Product Manager MBA (Intern) United States",
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": "What You'll Do\n\nDevelop strategic marketing plans for a product or product line through market research, competitive analysis, pricing, customer engagement, and business planning\nDrive new business and opportunities for the business unit and technology group\nDevelop innovative product features and functionality in partnership with Engineering and UX\nProvide customer use-case examples to Engineering and act as the primary liaison customer feedback and requirements and R&D. Drive resolution of customer happiness issues. Handle issues associated with ordering of product, systems and tools, and manufacturing supply\nForecast and help drive opportunities for product lines with annual revenues from $100M to $4B. Identify areas for growth and craft strategic product line roadmaps to help drive adoption of the product and differentiating features\nDevelop and drive results-oriented campaigns across various markets to ensure Cisco's market share and profitability including media releases, launch materials, customer presentations, videos, podcasts, and sales training materials\n\nWho You'll Work With\nFind the career path in Product Management that you’re passionate about! Cisco provides an environment that allows your creativity to become a reality. Work as part of a global team. Collaborate with Cisco leaders via social events, information sessions, and brown bag lunches. Partner with an experienced mentor. It’s your career, own it. \n\nWho You Are\n\nYou are pursuing an MBA (technical or business undergrad preferred)\nYou are a self-motivated and forward-thinking individual\nStrong written, verbal, and interpersonal communication along with strong presentation abilities, adept business knowledge and interpersonal skills round out your portfolio\nYour strong people skills allow you to easily partner with people at all levels\nYou possess the ability to handle multiple tasks and work towards long-term goals\n\nWhy Cisco\n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all. \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box!\n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)\n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.\n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-12-06T18:32:49.102Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/User-Experience-Master-s-Intern-United-States/1338423",
    "position": "User Experience Master's (Intern) United States",
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": "What You’ll Do  \n\nInteraction Designer - Design end to end user experiences through brainstorming, conceptual models, use cases and scenarios, personas, wireframe mock-ups, interactions flows, low-fidelity prototypes, and specification documents  \n\nVisual Designer - Design end to end user experiences through conceptual design, visual systems and language, mood boards, low- and medium-fidelity prototypes, final comps, and visual specification documents  \n\nUser Research -Plan and execute research studies with guidance from the User Research Lead.  \n\nWho You'll Work With  \n\nBillions of people are counting on you. Join Cisco to help improve their online experiences! We’re looking for great people who thrive on the challenge of building great products. Our products include cloud, social, mobile/wireless, video, VoIP, big data, collaboration, web, and Internet of Things, TelePresence and a lot more. We’re looking for people who will help us build these technologies for the future and, more importantly, define what we should do when they all come together. Bring your knowledge of building great user experiences and take it to a new level as you dive in and help us build the future of communication and collaboration.  \n\nWho You Are  \n\nCurrently pursuing a master’s degree in Human-Computer Interaction, User Experience Design, Human Factors, Product Design, Industrial Design, Visual or Graphic Design, Communications Design, or a related major  \n\nSolid understanding of user-centered design based on HCI, visual, or industrial design foundations  \n\nProduce clear, user-centric design across mobile, desktop, web and hardware endpoints  \n\nContribute to all aspects of design including need-finding, user research, concepting, detailed design, development of use cases and scenarios, and engineering support  \n\nPartner closely with engineering and product management to rapidly iterate on designs based on user feedback, tech constraints, and market dynamics  \n\nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship \n\nWhy Cisco \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns, and protects. No other company can do what we do – you can’t put us in a box! \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-12-06T18:32:49.102Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/User-Experience-Bachelor-s-Intern-United-States/1338396",
    "position": "User Experience Bachelor's (Intern) United States",
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": "What You’ll Do  \n\nInteraction Designer - Design end to end user experiences through brainstorming, conceptual models, use cases and scenarios, personas, wireframe mock-ups, interactions flows, low-fidelity prototypes, and specification documents  \n\nVisual Designer - Design end to end user experiences through conceptual design, visual systems and language, mood boards, low- and medium-fidelity prototypes, final comps, and visual specification documents  \n\nUser Research -Plan and execute research studies with guidance from the User Research Lead.  \n\nWho You'll Work With  \n\nBillions of people are counting on you. Join Cisco to help improve their online experiences! We’re looking for phenomenal people who thrive on the challenge of building great products. Our products include cloud, social, mobile/wireless, video, VoIP, big data, collaboration, web, and Internet of Things, TelePresence and a lot more. We’re looking for people who will help us build these technologies for the future and, more importantly, define what we should do when they all come together. Bring your knowledge of building great user experiences and take it to a new level as you dive in and help us build the future of communication and collaboration.  \n\nWho You Are  \n\nOur minimum requirements for this role:  \n\nCurrently pursuing a Bachelor's degree in Human-Computer Interaction, User Experience Design, Human Factors, Product Design, Industrial Design, Visual or Graphic Design, Communications Design, or a related major  \n\nProven understanding of user-centered design based on HCI, visual, or industrial design foundations  \n\nProduce clear, user-centric design across mobile, desktop, web and hardware endpoints  \n\nContribute to all aspects of design including need-finding, user research, concepting, detailed design, development of use cases and scenarios, and engineering support  \n\nPartner closely with engineering and product management to rapidly iterate on designs based on user feedback, tech constraints, and market dynamics  \n\nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship \n\nWhy Cisco \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns, and protects. No other company can do what we do – you can’t put us in a box! \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-12-06T18:32:49.102Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Software-Engineer-Master-s-Intern-United-States/1338368",
    "position": "Software Engineer Master's (Intern) United States",
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": "What You’ll Do \n\nOur software engineers are the gurus behind the scenes ensuring our all of our programs are easy to use and bug free. Using a keen eye, you’ll develop software and tools in support of many of our high-impact technology platforms such as operating systems, networks, databases and more. While we’re growing in the software business, you’ll still need to see the big picture and watch for hardware compatibility while even potentially influencing design. \n\nWho You’ll Work With \n\nOur hardworking team members are busy programming magic across the globe on teams such as Engineering, Information Technology, Supply Chain, Customer Experience, Security and Trust, etc. \n\nYou would play a crucial role in driving next-gen software innovations including cloud, mobile, desktop or security spaces. On any of these teams, you'll get hands-on experience working with applications that make technology accessible no matter what device they’re on. See the possibilities when creativity meets design and build solutions which will transform how we work, live, learn, and play. \n\nWho You Are \n\nPursuing a Master’s degree in Computer Science, Computer Engineering, Electrical Engineering, or related program \n\nUp-to-date on programming and scripting languages: C/C++, Python, Java \n\nKnowledge of Linux, Networking concepts, OS fundamentals, Embedded Development, and/or ML \n\nHands on QA, Testing, and/or Debugging skills \n\nExperience with Databases, Web Application Development, and Web Services \n\nWhy Cisco \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-12-06T18:32:49.102Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Software-Engineer-Bachelor-s-Intern-United-States/1338366",
    "position": "Software Engineer Bachelor's (Intern) United States",
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": "What You’ll Do \n\nOur software engineers are the gurus behind the scenes ensuring our all of our programs are easy to use and bug free. Using a keen eye, you’ll develop software and tools in support of many of our high-impact technology platforms such as operating systems, networks, databases and more. While we’re growing in the software business, you’ll still need to see the big picture and watch for hardware compatibility while even potentially influencing design. \n\nWho You’ll Work With \n\nOur hardworking team members are busy programming magic across the globe on teams such as Engineering, Information Technology, Supply Chain, Customer Experience, Security and Trust, etc. \n\nYou would play a crucial role in driving next-gen software innovations including cloud, mobile, desktop or security spaces. On any of these teams, you'll get hands-on experience working with applications that make technology accessible no matter what device they’re on. See the possibilities when creativity meets design and build solutions which will transform how we work, live, learn, and play. \n\nWho You Are \n\nPursuing a Bachelor’s degree in Computer Science, Computer Engineering, Electrical Engineering, or related program \nUp-to-date on programming and scripting languages: C/C++, Python, Java \nKnowledge of Linux, Networking concepts, OS fundamentals, Embedded Development, and/or ML \nHands on QA, Testing, and/or Debugging skills \nExperience with Databases, Web Application Development, and Web Services \nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship \n\nWhy Cisco \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2021-12-06T18:32:49.102Z"
  }
]