[
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Network-Support-Engineer-Intern-Fall-2022-Internship-Meraki/1363820",
    "position": "Network Support Engineer Intern - Fall 2022 Internship (Meraki)",
    "location": {
      "city": "Chicago",
      "state": "Illinois",
      "country": ""
    },
    "description": "Fall  Internship (August - December 2022, full-time) in Chicago, IL\n\nCisco Meraki Business Unit\n\nAt Cisco Meraki, our Network Support Engineering team troubleshoots cases that cover the entire Meraki product line, including our wireless access points, security appliances, cameras, switches, and Systems Manager application!\n\nThe Network Support Internship allows individuals to explore the wonders of Networking by developing an understanding of networking fundamentals through structured classroom instruction, Packet Tracer exposure, labs, and troubleshooting scenarios instructed by a Meraki Intern Instructor/Mentor.\n\nWith a steep learning curve and a fun, fast paced work environment, our interns come out of the program with a deeper understanding of networking, stronger problem-solving skills, and a mastery of customer support.\n\nYou will…\n\nParticipate in and successfully complete structured classroom workshops specific to core CCNA preparation administered by a Meraki instructor\nWork through lab assignments via Packet Tracer, NetAcad labs, and Meraki troubleshooting labs to learn the foundations of networking and troubleshooting\nGain an understanding of the networking field by participating and engaging in various courses\nAssist with lab testing work as needed for Meraki products\nIdentify issues suitable for entry in the Meraki Knowledge Base\nEffectively communicate with third parties such as partners and customers regarding technical issues and customer service inquiries, both orally and in writing\nCollaborate with other Support team members to fix network outages, misconfigurations, and complex networking issues of customers’ devices\nRead and analyze packet capture using Wireshark\n\nYou are….\n\nJunior or senior pursuing a bachelor's degree with a computer science, information technology, networking, systems administration, or a related field from an accredited university. Individuals already graduated or pursuing a master’s degree will not be considered\nHardworking and interested in exploring the Networking field\nPassionate to assist and problem-solve with customers\nAble to strategically and critically think about how to look for solutions, willing to be pushed outside your knowledge areas, and eager to learn and find solutions\nAn efficient communicator and problem-solver\nNetworking certifications a plus: CCNA, CCNP CWNA, etc.\nExperience supporting or testing LANs, VLANs, WLANs, VPNs, NAT devices, &/or DHCP servers is a plus\nComprehension of networking protocols, including TCP, STP, ARP, Ethernet, OSPF, etc. is a plus\nPreferred experiences within helpdesk, technical call center, desktop support, or past networking experiences preferred, but not required. \nAuthorized to work in the U.S. without requiring sponsorship now or in the future \n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Full-Stack-Engineer-Summer-2022-Internship-Bachelors-Meraki/1353180",
    "position": "Full Stack Engineer Summer 2022 Internship, Bachelors (Meraki)",
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": "Summer Internship (May - August 2022), full-time work schedule, Monday- Friday 40 hours per week\n\nCisco Meraki Business Unit\n\nThe modern world runs on the Internet, and the Internet cannot exist without its underlying infrastructure. Meraki makes setting up, managing, and maintaining that infrastructure easier than it has ever been before. Meraki enables connectivity everywhere from neighborhood cafes to education institutions to global hospitality groups operating thousands of sites.\n\nAs a Full Stack Engineer at Meraki, you will help craft and build features for Meraki's Dashboard - the window to the entire Meraki experience. From Dashboard, our customers can control their entire Meraki stack: access points, switches, firewalls, client devices, cameras, and more. You will work across the stack with other developers, UX designers, and product management to build and improve the Dashboard web application. Meraki engineers put the customer experience first, own projects from beginning to end, and are empowered to make impactful decisions.\n\nMeraki believes that the quality of our product is dependent on the quality of our engineers. We place a high value on nurturing the growth and development of everyone on our team. We foster an open and supportive workplace where everybody is given the opportunity to succeed.\n\nExample projects of a Full Stack Web Developer Intern:\nCreate services to fetch data from millions of Meraki devices, then present that data in a user-friendly way\nImprove performance and efficiency of our backend, allowing us to handle increasingly large datasets with minimal delay\nBuild internal frameworks and refine front end infrastructure to augment developer productivity\nConstruct API endpoints to allow Meraki users and third party companies to build custom tools and features\nBuild a dashboard for anomaly / outlier detection on network traffic using machine learning algorithms\nBuild a graph for network traffic analysis using clustering and other algorithms\nYou are an outstanding applicant if:\nYou are pursuing a technical bachelors degree or have equivalent experience with a strong foundation in the fundamentals of computer science\nYou strive to build rich and dynamic web applications with front-end frameworks such as React, Redux, Ember, or Angular\nYou are familiar with programming languages and web frameworks like Ruby (Rails, EventMachine), Python (Django, Flask), or Node.js (Express)\nYou have worked with SQL and relational Databases\nYou would flourish within a small engineering team and are excited to tackle open-ended problems\nIntern Program Overview:\n\nMeraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto subteams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the majority of the program on a larger project, such as building the infrastructure for a new service. Projects are cross functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program.  Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\nIntern Benefits:\n\nHousing Assistance\n\nCompetitive salary\n\nWeekly social events inside and outside of the office (Giants games, Exploratorium tickets, friendly soccer games)\n\nLunch and dinner daily\n\nCustomized laptop and desk setups\n\nMedical coverage plan\n\nCisco requires all U.S. employees to be fully vaccinated or have an approved religious or medical accommodation. Candidates accepting an offer must provide proof of vaccination status on their first day. If someone anticipates requesting an accommodation for this requirement, they must receive approval before the start date. Candidates receiving an offer will receive additional information about the accommodation process at the time of the offer. All offers of employment are contingent upon complying with Cisco's vaccination policy.\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Test-Automation-Engineer-Summer-2022-Internship-Bachelors-Meraki/1348849",
    "position": "Test Automation Engineer Summer 2022 Internship, Bachelors (Meraki)",
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": "Summer Internship (May 2022 - August, full-time work schedule, Monday- Friday 40 hours per week)\n\nCisco Meraki Business Unit\n\nSimplicity. Meraki makes setting up, managing, and maintaining networks easier than it has ever been before. Simplified and smarter networking means that businesses run more efficiently, and more people have reliable access to the information they need. Meraki enables connectivity everywhere from neighborhood cafes to education institutions to global hospitality groups operating thousands of sites.\n\nYou will join a test automation team that is fully embedded within our software engineering team. We handle all types of testing projects for our cloud managed products; from nightly feature tests across the latest firmware images to performance testing of all kinds. We run large scale testing to measure how small changes could impact our performance. Our automation framework is being used across software engineering, and we continue to make it more intuitive. Our products are used in over a million networks and our customers rely on our products to serve ten of millions of people. With the large footprint that we have, quality is our highest priority. We are looking for the newest additions to our teams who are as passionate about quality as we are. Meraki engineers put the customer experience first, own projects from beginning to end, and are empowered to make impactful decisions. Your contributions will make direct impact to the success of our business.\n\nMeraki believes that the quality of our product is dependent on the quality of our engineers. We place a high value on nurturing the growth and development of everyone on our team. We foster an open and encouraging workplace where everybody is given the opportunity to succeed.\n\nA day in the life of Test Automation Engineering Intern:\n\nYou may design a testbed from the ground up that has the ability to change topologies on the fly. You will have an in-house automation framework at your disposal as well as APIs to hook into for further automation. You will have the autonomy to craft and implement a solution as well as the knowledge and experience of team members to help you along the way.\n\nIn addition to software testing, you may have a chance to work on our latest hardware appliances from an early phase of development. You will get to learn some of the cool technologies inside the box. Through testing, you will gain firsthand knowledge about the performance and be able to guide the team in improving the quality before we release the product.\n\nWhat does it take?\nYou are pursuing a bachelors technical degree or equivalent experience with a great foundation in the fundamentals of computer science and computer networking\nYou are proficient in scripting languages such as Ruby or Python\nYou are proficient in Lunix and REST API\nYou have solid understanding of core network protocols like TCP/IP, DHCP, DNS, VLANS, etc.\nYou have experience in performance testing\nYou have CCNA or equivalent certification\nYou have familiarity with UI framework such as React/Ember/Angular\nYou have familiarity with IPv6 and routing protocols like OSPF and BGP\nYou have worked with virtualization or container technology, such as ESXi, Xen, Docker, etc.\nYou have used development infrastructure tools such as Jenkins, Git, Gerrit, and JIRA and/or have experience with Database solutions (e.g, InfluxDB, PostgreSQL, etc)\nIntern Program Overview:\n\nMeraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto sub-teams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the bulk of the program on a larger project, such as building the infrastructure for a new service. Projects are multi-functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program. Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\nIntern Benefits:\nHousing assistance in San Francisco for duration of program\nCompetitive salary\nWeekly social events inside and outside of the office (Giants games, Exploratorium tickets, friendly soccer games)\nLunch and dinner daily\nCustomized laptop and desk setups\nMedical coverage plans\n\nCisco requires all U.S. employees to be fully vaccinated or have an approved religious or medical accommodation. Candidates accepting an offer must provide proof of vaccination status on their first day. If someone anticipates requesting an accommodation for this requirement, they must receive approval before the start date. Candidates receiving an offer will receive additional information about the accommodation process at the time of the offer. All offers of employment are contingent upon complying with Cisco's vaccination policy.\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/UX-Designer-UX-Researcher-Intern-Summer-2022-Internship-Meraki/1345408",
    "position": "UX Designer / UX Researcher Intern - Summer 2022 Internship (Meraki)",
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": "UX Design / Research Internship, Summer 2022 (end of May to mid August 2022), Remote\n\nPlease include a link to your portfolio in your application or within your resume\n\nMeraki makes setting up and maintaining reliable Internet and Internet-powered devices easier than ever before. We enable organizations everywhere, from local libraries to hotels operating worldwide, to focus on their mission and have technology that simply works.\n\nWe’re looking for a UX Design intern to join us in simplifying IT! As a UX intern at Meraki, you will be responsible for the design of interactions and components. Collaborating with other designers, researchers, and partners in product management and engineering, you will collect data and conduct research to understand users’ goals, and you will explore and iterate on solutions.\n\nWe place a high value on encouraging the growth and development of everyone on the team. On the UX team, we give and get feedback early and often, share what we know, and learn from each other. UX interns will be paired with a mentor and work closely with them throughout their internship.\n\nThe UX team’s primary focus is on software, but we also find opportunities to collaborate with teams across the organization and think about how to improve the entire customer journey.\n\nResponsibilities\nLearn about the domain and workflows of our users\nResearch: Run and synthesize research, collaborate to create solutions with designers, engineers, and product managers\nDesign: Design lo-fi and hi-fi interactions, collaborate with teammates to prototype solutions\nIterate on designs based on peer feedback, user research, usability testing, analytics, and other data\nPresent rationale for product decisions\nSolicit feedback from designers, researchers, and other collaborators\nQualifications\nMust be pursuing a degree towards Human-Computer Interaction, Graphic Design, Interaction Design, UX Design, Media Arts, or similar\nDriven, eager, and open to learning new skills and deepening your area(s) of expertise\nExcellent communicator and take initiative to check-in with your teammates\nFocus area and strength in user-centered research, human-centered design, or both\nCollaborated with people in other fields (engineering, product, etc.) and worked as a team\nInvestigated problems in screen-based products and fashioned sophisticated solutions. Assessed the impact of the solutions and iterated on them.\nA basic understanding and familiarity with front-end code (HTML/CSS)\n\nCisco requires all U.S. employees to be fully vaccinated or have an approved religious or medical accommodation. Candidates accepting an offer must provide proof of vaccination status on their first day. If someone anticipates requesting an accommodation for this requirement, they must receive approval before the start date. Candidates receiving an offer will receive additional information about the accommodation process at the time of the offer. All offers of employment are contingent upon complying with Cisco's vaccination policy.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Site-Reliability-Engineer-Summer-2022-Internship-Bachelors-Meraki/1341219",
    "position": "Site Reliability Engineer Summer 2022 Internship, Bachelors (Meraki)",
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": "Site Reliability Engineer\n\nSummer Internship (May- August), full-time work schedule, Monday - Friday / 40 hours)\n\nCisco Meraki Business Unit\n\nAs a Site Reliability Engineer Intern/Co-op on the Meraki Backend Infrastructure Team, you will work on projects responsible for everything from our server hardware and operating systems to tools for code deployment and service monitoring. You will have the opportunity to build software and systems to monitor, scale and deploy our distributed cloud services.\n\nMeraki's Backend Infrastructure Team is responsible for building and scaling the cloud that supports millions of Meraki devices across the world. Meraki’s customer base has grown by a factor of 2-3 every year, serving more than 1.5 billion HTTP requests per day across six data centers. Our customers depend on the Meraki cloud to manage and monitor their critical infrastructure of network switches, security appliances, wireless APs, security cameras, and phones.\n\nIn this role, you will be part of a small engineering team that is based out of Meraki’s San Francisco headquarters. During your time here, you will make crucial decisions about how to manage and scale complex, high-performance distributed systems. You will also provide your own perspective on our backend systems and help develop innovative ways to improve the way we manage the underlying infrastructure.\n\nWhat we look for in our SRE intern/co-op candidates:\n\nJunior/Senior status pursuing a BA/BS in Computer Science, ECE, EE, ME or STEM related field (in progress), no masters\nClear and effective communication skills\nProactive learners who can quickly pick up working in multiple frameworks, languages and environments\nPassionate team players\nContinually able to learn from experience and eager for feedback\nPrevious internship or large scale project experience\nA strong foundation in the fundamentals of Computer Science (familiarity with networking, data visualization, Ruby on Rails, C/C++ or an understanding of databases)\n \nBonus Points:\nKnow your way around *nix systems. We run Debian.\nAre familiar with logging and monitoring tools such as Graphite, Grafana, Logstash, ElasticSearch, statsd, collectd.\n\nProjects and Work Life:\n\nMeraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto subteams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the majority of the program on a larger project, such as building the infrastructure for a new service. Projects are cross functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program.  Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\nExamples of Past Projects\n\nAdding at-rest encryption to our cloud-based database backups\nRevamping our Organization Move process to move customers between servers\nImplementing Docker Containers to move our infrastructure to a containerized world\n\nIntern Benefits:\n\nHousing Assistance \nCompetitive salary\nWeekly social events inside and outside of the office (Giants games, Exploratorium tickets,    friendly soccer games)\nLunch and dinner daily\nCustomized laptop and desk setups\nMedical, dental, and vision coverage plans\n\nCisco requires all U.S. employees to be fully vaccinated or have an approved religious or medical accommodation. Candidates accepting an offer must provide proof of vaccination status on their first day. If someone anticipates requesting an accommodation for this requirement, they must receive approval before the start date. Candidates receiving an offer will receive additional information about the accommodation process at the time of the offer. All offers of employment are contingent upon complying with Cisco's vaccination policy.\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Technical-Marketing-Engineer-Intern-United-States/1338945",
    "position": "Technical Marketing Engineer (Intern) United States",
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": "What You'll Do  \n\nWe are looking for a Technical Marketing Engineer to promote and increase customer adoption of various enterprise technologies such as network visibility, security, switching, wireless, routing, and Software Defined intent based networking technologies. We are seeking a motivated, detail oriented & committed engineer that will rise to the challenge to communicate, design, build & help customers and sales teams on enterprise networking technologies. Often times you will work as part of a team as well as independently in customer engagements of the latest technologies. You should be curious and eager to learn about new products, technologies, and solutions to provide valuable input and communication to the sales, engineering, and product management organization. The engineer will help drive the future technical product direction. Be a technical consultant on customer calls and meetings. Work closely with the field, key Systems Integrators, Engineering, and Cisco Technology Partners in an Agile environment. Work with automation or cloud software to enable next generation network design and network architectures. Develop automated methods to own the network and optimize our customer's user experience. Build messaging about key customer challenges and benefits of Cisco's solutions based on use cases. Build Documents and Presentations with technical details for the products, technologies, and solutions. Travel and deliver training to customers, partners, sales teams both domestically and internationally at events and customer locations  \n\nWho You'll Work With  \n\nCisco’s Enterprise Networking Group is a core technology group within Cisco. By defining and delivering market-leading campus networking solutions with Cisco Digital Network Architecture (DNA) which is an intent-based networking architecture that delivers advanced solutions for enterprises.  \n\nWho You Are  \n\nLoves technology, computer networking, loves automation, loves digital. Self-starter who is passionate about ground-breaking technology and driving change. Has a strong sense of ownership, loves turning ambiguity into real outcomes, working across all functions and matrixed teams, embraces the belief that leadership happens from all levels, and we are better together than any one of us in individually.  \n\nActively enrolled and pursuing a B.S. or M.S. degree in Computer Science, Electrical Engineering or related technical field or program\n\nExcellent communication skills both in technical and non-technical discussions  \n\nExcellent analytical skills. Confirmed ability to understand sophisticated and in-depth level technical situations, related business challenges, and be able to communicate these technologies in a clear and simple way to customers and sales teams.  \n\nDevOps Programming and scripting experience in Python, Linux, or other programming language is desired  \n\nInterest and knowledge of networking technologies and networking is desired. Cisco Routing, Catalyst Switching, IOS XE, Aironet AP and Wireless controller experience is desired. Cisco certifications is desired.  \n\nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n \nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! \n \nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n \nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n \nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/User-Experience-Master-s-Intern-United-States/1338423",
    "position": "User Experience Master's (Intern) United States",
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": "What You’ll Do  \n\nInteraction Designer - Design end to end user experiences through brainstorming, conceptual models, use cases and scenarios, personas, wireframe mock-ups, interactions flows, low-fidelity prototypes, and specification documents  \n\nVisual Designer - Design end to end user experiences through conceptual design, visual systems and language, mood boards, low- and medium-fidelity prototypes, final comps, and visual specification documents  \n\nUser Research -Plan and execute research studies with guidance from the User Research Lead.  \n\nWho You'll Work With  \n\nBillions of people are counting on you. Join Cisco to help improve their online experiences! We’re looking for great people who thrive on the challenge of building great products. Our products include cloud, social, mobile/wireless, video, VoIP, big data, collaboration, web, and Internet of Things, TelePresence and a lot more. We’re looking for people who will help us build these technologies for the future and, more importantly, define what we should do when they all come together. Bring your knowledge of building great user experiences and take it to a new level as you dive in and help us build the future of communication and collaboration.  \n\nWho You Are  \n\nCurrently pursuing a master’s degree in Human-Computer Interaction, User Experience Design, Human Factors, Product Design, Industrial Design, Visual or Graphic Design, Communications Design, or a related major  \n\nSolid understanding of user-centered design based on HCI, visual, or industrial design foundations  \n\nProduce clear, user-centric design across mobile, desktop, web and hardware endpoints  \n\nContribute to all aspects of design including need-finding, user research, concepting, detailed design, development of use cases and scenarios, and engineering support  \n\nPartner closely with engineering and product management to rapidly iterate on designs based on user feedback, tech constraints, and market dynamics  \n\nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship \n\nWhy Cisco \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns, and protects. No other company can do what we do – you can’t put us in a box! \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/User-Experience-Bachelor-s-Intern-United-States/1338396",
    "position": "User Experience Bachelor's (Intern) United States",
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": "What You’ll Do  \n\nInteraction Designer - Design end to end user experiences through brainstorming, conceptual models, use cases and scenarios, personas, wireframe mock-ups, interactions flows, low-fidelity prototypes, and specification documents  \n\nVisual Designer - Design end to end user experiences through conceptual design, visual systems and language, mood boards, low- and medium-fidelity prototypes, final comps, and visual specification documents  \n\nUser Research -Plan and execute research studies with guidance from the User Research Lead.  \n\nWho You'll Work With  \n\nBillions of people are counting on you. Join Cisco to help improve their online experiences! We’re looking for phenomenal people who thrive on the challenge of building great products. Our products include cloud, social, mobile/wireless, video, VoIP, big data, collaboration, web, and Internet of Things, TelePresence and a lot more. We’re looking for people who will help us build these technologies for the future and, more importantly, define what we should do when they all come together. Bring your knowledge of building great user experiences and take it to a new level as you dive in and help us build the future of communication and collaboration.  \n\nWho You Are  \n\nOur minimum requirements for this role:  \n\nCurrently pursuing a Bachelor's degree in Human-Computer Interaction, User Experience Design, Human Factors, Product Design, Industrial Design, Visual or Graphic Design, Communications Design, or a related major  \n\nProven understanding of user-centered design based on HCI, visual, or industrial design foundations  \n\nProduce clear, user-centric design across mobile, desktop, web and hardware endpoints  \n\nContribute to all aspects of design including need-finding, user research, concepting, detailed design, development of use cases and scenarios, and engineering support  \n\nPartner closely with engineering and product management to rapidly iterate on designs based on user feedback, tech constraints, and market dynamics  \n\nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship \n\nWhy Cisco \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns, and protects. No other company can do what we do – you can’t put us in a box! \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Test-Automation-Engineer-Fall-2022-Internship-Meraki/1365592",
    "position": "Test Automation Engineer Fall 2022 Internship (Meraki)",
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": "Fall Internship (August - December, full-time work schedule, Monday- Friday 40 hours per week)\n\nCisco Meraki Business Unit\n\nSimplicity. Meraki makes setting up, managing, and maintaining networks easier than it has ever been before. Simplified and smarter networking means that businesses run more efficiently, and more people have reliable access to the information they need. Meraki enables connectivity everywhere from neighborhood cafes to education institutions to global hospitality groups operating thousands of sites.\n\nYou will join a test automation team that is fully embedded within our software engineering team. We handle all types of testing projects for our cloud managed products; from nightly feature tests across the latest firmware images to performance testing of all kinds. We run large scale testing to measure how small changes could impact our performance. Our automation framework is being used across software engineering, and we continue to make it more intuitive. Our products are used in over a million networks and our customers rely on our products to serve ten of millions of people. With the large footprint that we have, quality is our highest priority. We are looking for the newest additions to our teams who are as passionate about quality as we are. Meraki engineers put the customer experience first, own projects from beginning to end, and are empowered to make impactful decisions. Your contributions will make direct impact to the success of our business.\n\nMeraki believes that the quality of our product is dependent on the quality of our engineers. We place a high value on nurturing the growth and development of everyone on our team. We foster an open and encouraging workplace where everybody is given the opportunity to succeed.\n\nA day in the life of Test Automation Engineering Intern:\n\nYou may design a testbed from the ground up that has the ability to change topologies on the fly. You will have an in-house automation framework at your disposal as well as APIs to hook into for further automation. You will have the autonomy to craft and implement a solution as well as the knowledge and experience of team members to help you along the way.\n\nIn addition to software testing, you may have a chance to work on our latest hardware appliances from an early phase of development. You will get to learn some of the cool technologies inside the box. Through testing, you will gain firsthand knowledge about the performance and be able to guide the team in improving the quality before we release the product.\n\nWhat does it take?\nYou are pursuing a technical bachelors degree or have equivalent experience with a strong foundation in the fundamentals of computer science and computer networking -OR- pursuing a educational training program and/or technical associates \nYou are proficient in scripting languages such as Ruby or Python\nYou are proficient in Lunix and REST API\nYou have solid understanding of core network protocols like TCP/IP, DHCP, DNS, VLANS, etc.\nYou have experience in performance testing\nYou have CCNA or equivalent certification\nYou have familiarity with UI framework such as React/Ember/Angular\nYou have familiarity with IPv6 and routing protocols like OSPF and BGP\nYou have worked with virtualization or container technology, such as ESXi, Xen, Docker, etc.\nYou have used development infrastructure tools such as Jenkins, Git, Gerrit, and JIRA and/or have experience with Database solutions (e.g, InfluxDB, PostgreSQL, etc)\nIntern Program Overview:\n\nMeraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto sub-teams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the bulk of the program on a larger project, such as building the infrastructure for a new service. Projects are multi-functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program. Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\nIntern Benefits:\nHousing assistance \nCompetitive salary\nWeekly social events inside and outside of the office (Giants games, Exploratorium tickets, friendly soccer games)\nLunch and dinner daily\nCustomized laptop and desk setups\nMedical coverage plans\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Site-Reliability-Engineer-Fall-2022-Internship-Meraki/1365415",
    "position": "Site Reliability Engineer Fall 2022 Internship (Meraki)",
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": "Site Reliability Engineer\n\nFall Internship (August-December), full-time work schedule, Monday - Friday / 40 hours)\n\nCisco Meraki Business Unit\n\nAs a Site Reliability Engineer Intern/Co-op on the Meraki Backend Infrastructure Team, you will work on projects responsible for everything from our server hardware and operating systems to tools for code deployment and service monitoring. You will have the opportunity to build software and systems to monitor, scale and deploy our distributed cloud services.\n\nMeraki's Backend Infrastructure Team is responsible for building and scaling the cloud that supports millions of Meraki devices across the world. Meraki’s customer base has grown by a factor of 2-3 every year, serving more than 1.5 billion HTTP requests per day across six data centers. Our customers depend on the Meraki cloud to manage and monitor their critical infrastructure of network switches, security appliances, wireless APs, security cameras, and phones.\n\nIn this role, you will be part of a small engineering team that is based out of Meraki’s San Francisco headquarters. During your time here, you will make crucial decisions about how to manage and scale complex, high-performance distributed systems. You will also provide your own perspective on our backend systems and help develop innovative ways to improve the way we manage the underlying infrastructure.\n\nWhat we look for in our SRE intern/co-op candidates:\n\nYou are pursuing a technical bachelors degree or have equivalent experience with a strong foundation in the fundamentals of computer science -OR- pursuing a software/coding boot camp (or educational training program) and/or technical associates degree with a strong foundation in the fundamentals of computer science. \nClear and effective communication skills\nProactive learners who can quickly pick up working in multiple frameworks, languages and environments\nPassionate team players\nContinually able to learn from experience and eager for feedback\nPrevious internship or large scale project experience\nA strong foundation in the fundamentals of Computer Science (familiarity with networking, data visualization, Ruby on Rails, C/C++ or an understanding of databases)\n \nBonus Points:\nKnow your way around *nix systems. We run Debian.\nAre familiar with logging and monitoring tools such as Graphite, Grafana, Logstash, ElasticSearch, statsd, collectd.\n\nProjects and Work Life:\n\nMeraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto subteams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the majority of the program on a larger project, such as building the infrastructure for a new service. Projects are cross functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program.  Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\nExamples of Past Projects\n\nAdding at-rest encryption to our cloud-based database backups\nRevamping our Organization Move process to move customers between servers\nImplementing Docker Containers to move our infrastructure to a containerized world\n\nIntern Benefits:\n\nHousing Assistance \nCompetitive salary\nWeekly social events inside and outside of the office (Giants games, Exploratorium tickets,    friendly soccer games)\nLunch and dinner daily\nCustomized laptop and desk setups\nMedical, dental, and vision coverage plans\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Product-Software-Engineer-Intern-Fall-2022-Meraki/1364825",
    "position": "Product Software Engineer Intern - Fall 2022 (Meraki)",
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": "Fall Internship (September 2022- December 2022, full-time work schedule, Monday- Friday 40 hours per week)\n\nThe modern world runs on the Internet, and the Internet cannot exist without its underlying infrastructure. Meraki makes setting up, managing, and maintaining that infrastructure easier than it has ever been before. Meraki enables connectivity everywhere from neighborhood cafes to elite universities to global hospitality groups operating thousands of sites.\n\nAs a Product Software Engineer at Meraki, you will bring life to our products, imbuing them with what some call the Meraki Magic. Through your contributions, you will enable our customers to do more things more easily than ever before. You will have opportunities to work across our stack, developing software ranging from bootloaders, device drivers, and routing code to our distributed, cloud-hosted backend.\n\nHere are some of the projects you might find yourself working on:\n\nDesigning and implementing (usually in C/C++) features to improve the reliability, simplicity, and performance of our devices, as well as make them more flexible and powerful\nBringing up our Linux-based system on new hardware platforms\nCollaborating with our hardware engineers on the design of new platforms\nYou’re the kind of person we’re looking for if:\nBA/BS in Computer Science, ECE, EE, ME or STEM related field (in progress) OR pursuing a software boot camp (or educational training program) and/or technical AA with a strong foundation in the fundamentals of computer science \nYou are comfortable writing systems-level C/C++ (or if you’ve written your own OS!)\nYou have familiarity developing and implementing computer networking fundamentals (TCP/IP, routing protocols, IPv6, etc.)\nYou have worked with Linux on embedded platforms\nYou have an understanding of OS fundamentals and experience working in both kernel and user space\nYou love being a part of a tight-knit, hard-working team and want to have an impact with your own work while also elevating your teammates\nYou have previous internship or large project experience\n\nAs a software engineer early in your career, you may still be identifying areas that you are curious about or in which would like to develop more depth. At Meraki, you will have the opportunity to explore multiple technology areas and problem domains. Whether you have a passion for user interfaces, distributed systems, network protocols, or embedded development — or perhaps more than one of these — you will be able to dive deep here. Together with your team you will craft from top to bottom the suite of innovative products that make Meraki unique.\n\nIntern Program Overview:\n\nMeraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto subteams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the bulk of the program on a larger project, such as building the infrastructure for a new service. Projects are multi-functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program. Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\nIntern Benefits:\nHousing Assistance\nCompetitive salary\nWeekly social events inside and outside of the office (Giants games, Exploratorium tickets, friendly soccer games)\nLunch and dinner daily\nCustomized laptop and desk setups\nMedical coverage plans\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Full-Stack-Software-Engineer-Intern-Fall-2022-Meraki/1363036",
    "position": "Full Stack Software Engineer Intern - Fall 2022 (Meraki)",
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": "Fall Internship (September 2022 - December 2022), full-time work schedule, Monday- Friday 40 hours per week\n\nCisco Meraki Business Unit\n\nThe modern world runs on the Internet, and the Internet cannot exist without its underlying infrastructure. Meraki makes setting up, managing, and maintaining that infrastructure easier than it has ever been before. Meraki enables connectivity everywhere from neighborhood cafes to education institutions to global hospitality groups operating thousands of sites.\n\nAs a Full Stack Engineer at Meraki, you will help craft and build features for Meraki's Dashboard - the window to the entire Meraki experience. From Dashboard, our customers can control their entire Meraki stack: access points, switches, firewalls, client devices, cameras, and more. You will work across the stack with other developers, UX designers, and product management to build and improve the Dashboard web application. Meraki engineers put the customer experience first, own projects from beginning to end, and are empowered to make impactful decisions.\n\nMeraki believes that the quality of our product is dependent on the quality of our engineers. We place a high value on nurturing the growth and development of everyone on our team. We foster an open and supportive workplace where everybody is given the opportunity to succeed.\n\nExample projects of a Full Stack Web Developer Intern:\nCreate services to fetch data from millions of Meraki devices, then present that data in a user-friendly way\nImprove performance and efficiency of our backend, allowing us to handle increasingly large datasets with minimal delay\nBuild internal frameworks and refine front end infrastructure to augment developer productivity\nConstruct API endpoints to allow Meraki users and third party companies to build custom tools and features\nBuild a dashboard for anomaly / outlier detection on network traffic using machine learning algorithms\nBuild a graph for network traffic analysis using clustering and other algorithms\nYou are an outstanding applicant if:\nYou are pursuing a technical bachelors degree or have equivalent experience with a strong foundation in the fundamentals of computer science -OR- pursuing a software/coding boot camp (or educational training program) and/or technical associates degree with a strong foundation in the fundamentals of computer science. \nYou strive to build rich and dynamic web applications with front-end frameworks such as React, Redux, Ember, or Angular\nYou are familiar with programming languages and web frameworks like Ruby (Rails, EventMachine), Python (Django, Flask), or Node.js (Express)\nYou have worked with SQL and relational Databases\nYou would flourish within a small engineering team and are excited to tackle open-ended problems\nIntern Program Overview:\n\nMeraki interns and co-ops join the team for 12 and 16 week programs, respectively, and are placed directly onto subteams. During the program, interns/co-ops have the opportunity to work on a small starter project, such as integration and implementation of new tools, before spending the majority of the program on a larger project, such as building the infrastructure for a new service. Projects are cross functional, which allow insight into new languages and technologies, help encourage professional growth within engineering, and allow a sense of ownership within the team.\n\nMeraki’s engineering teams place a high emphasis on mentorship. Each intern and co-op is matched 1:1 with a mentor who provides continual feedback and guidance throughout the duration of the program. Mentors help with introductions to other team members, overviews of tools and processes, and provide a seamless integration into Meraki life.\n\nIntern Benefits:\nHousing Assistance\nCompetitive salary\nWeekly social events inside and outside of the office (Giants games, Exploratorium tickets, friendly soccer games)\nLunch and dinner daily\nCustomized laptop and desk setups\nMedical coverage plan\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people. We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/UX-Designer-UX-Researcher-Intern-Fall-2022-Internship-Meraki/1365667",
    "position": "UX Designer / UX Researcher Intern - Fall 2022 Internship (Meraki)",
    "location": {
      "city": "San Francisco",
      "state": "California",
      "country": ""
    },
    "description": "UX Design / Research Internship, Fall 2022 (September 2022 - December 2022)\n\nPlease include a link to your portfolio in your application or within your resume\n\nMeraki makes setting up and maintaining reliable Internet and Internet-powered devices easier than ever before. We enable organizations everywhere, from local libraries to hotels operating worldwide, to focus on their mission and have technology that simply works.\n\nWe’re looking for a UX Design intern to join us in simplifying IT! As a UX intern at Meraki, you will be responsible for the design of interactions and components. Collaborating with other designers, researchers, and partners in product management and engineering, you will collect data and conduct research to understand users’ goals, and you will explore and iterate on solutions.\n\nWe place a high value on encouraging the growth and development of everyone on the team. On the UX team, we give and get feedback early and often, share what we know, and learn from each other. UX interns will be paired with a mentor and work closely with them throughout their internship.\n\nThe UX team’s primary focus is on software, but we also find opportunities to collaborate with teams across the organization and think about how to improve the entire customer journey.\n\nResponsibilities:\nLearn about the domain and workflows of our users\nResearch: Run and synthesize research, collaborate to create solutions with designers, engineers, and product managers\nDesign: Design lo-fi and hi-fi interactions, collaborate with teammates to prototype solutions\nIterate on designs based on peer feedback, user research, usability testing, analytics, and other data\nPresent rationale for product decisions\nSolicit feedback from designers, researchers, and other collaborators\nQualifications:\nMust be pursuing a degree towards Human-Computer Interaction, Graphic Design, Interaction Design, UX Design, Media Arts, or similar\nDriven, eager, and open to learning new skills and deepening your area(s) of expertise\nExcellent communicator and take initiative to check-in with your teammates\nFocus area and strength in user-centered research, human-centered design, or both\nCollaborated with people in other fields (engineering, product, etc.) and worked as a team\nInvestigated problems in screen-based products and fashioned sophisticated solutions. Assessed the impact of the solutions and iterated on them.\nA basic understanding and familiarity with front-end code (HTML/CSS)\nIntern Benefits:\nHousing Assistance\nCompetitive salary\nWeekly social events inside and outside of the office \nDaily lunch and dinner \nCustomized laptop and desk setups\nMedical coverage plan\n\nAt Cisco Meraki, we’re challenging the status quo with the power of diversity, inclusion, and collaboration. When we connect different perspectives, we can imagine new possibilities, inspire innovation, and release the full potential of our people! We’re building an employee experience that includes appreciation, belonging, growth, and purpose for everyone.\n\nCisco is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. Cisco will consider for employment, on a case by case basis, qualified applicants with arrest and conviction records.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Duo-Program-Manager-Bachelor-s-Intern-United-States/1359028",
    "position": "Duo Program Manager Bachelor's (Intern) United States",
    "location": {
      "city": "Ann Arbor",
      "state": "Michigan",
      "country": ""
    },
    "description": "Duo Security, Employee Programs Internship\n\nDuo Security’s Employee Programs team is looking for a Program Management Intern for the summer of 2022. Our goal on the Programs team is to curate opportunities for development, connection and belonging for our team at Duo. As a Program Management Intern, you’ll work on programs that ensure our organization is an excellent place to work and team members are effective and supported. You’ll think about everything from the experience of new employees as they begin their careers here to the needs of a dynamic team in an ever changing environment.\n\nWhat you’ll do…\n\nAs a Program Management Intern, you will\n\n●      Work embedded in the Programs team to maintain and improve the current programs we have in place. These programs include: learning & development, internships, events & celebrations, equity & belonging, and community engagement & social impact.\n\n●      Think about how to make sure all our teammates feel a sense of belonging and reduce barriers to brilliance.\n\n●      Help plan and execute events such as team celebrations, release parties, and more.\n\nSkills you have…\n\n●      You are extremely organized with outstanding communication skills, both verbal and written.\n\n●      You are a fast learner who can quickly learn new skills that might be needed to execute a program or event.\n\n●      You’re thoughtful, empathetic, and passionate about improving the day to day experiences of our diverse team.\n\n●      You are comfortable working independently, but know when to ask for more support.\n\n3 reasons why you should apply…\n\n●      You enjoy the growth and pride that comes with solving complex problems and interesting challenges in a fast-paced environment.\n\n●      You possess a highly driven and results-oriented personality, with an ability to get stuff done while having a sharp mind and eye for detail.\n\n●      You are energized by work that positively impacts the experiences of others.\n\nTips to make your application stand out: While academics are a strong signal to us, good grades aren't the only thing that matters to us.\n\n●      Have a side project or a passion project? Tell us about it.\n\n●      Past internships are a phenomenal way to show how you've made an impact and applied your knowledge to a real customer problem.\n\n●      We love to hear about experiences you’ve had where you’ve: learned something new, taken leadership / ownership of a project, helped / taught others, and/or delivered results.\n\nWe hope this list makes what we look for less ambiguous, but it’s not meant to be limiting! Tell us what makes you unique.\n\nInternship Details...\n\n●      You'll be working with our global teams with offices in Ann Arbor, MI, Austin, TX and London, UK with the opportunity to work remotely\n\n●      Program dates are May 23rd - August 19th\n\n●      Roles are full time and 40 hours per week, Monday - Friday\n\n●      Generous pay and employee perks\n\nDuo Security, now a part of Cisco, is the leading provider of Trusted Access security and multi-factor authentication delivered through the cloud.\n\nDuo’s mission is to make security simple for everyone. We were born from a hacker ethos and a desire to make the Internet a secure place. We believe in empowering people to follow their passions inside and outside of the office and enable every employee to bring their whole self to work.\n\nOur team is our secret weapon. We run the spectrum from artists to analysts, low-key to high energy, and bring together a diversity of skill sets, experiences, and perspectives to solve what we consider to be the world's most pressing geopolitical challenge — transforming the security industry as we know it. Together we build solutions that are easy, effective, trustworthy, and enduring. And that’s why we are the most loved and trusted company in security.\n\nDuo is committed to cultivating and preserving a culture of inclusion and connectedness. We are able to grow and learn better together with a diverse team of employees. The collective sum of the individual differences, life experiences, knowledge, innovation, self-expression, and talent that our employees invest in their work represents not only part of our culture, but our reputation and Duo’s achievement as well. In recruiting for our team, we welcome the unique contributions that all potential candidates can bring in terms of their education, opinions, culture, ethnicity, race, gender identity and expression, nationality, age, languages spoken, veteran’s status, religion, disability, sexual orientation and beliefs.\n\nAnd if this role is exciting to you, we encourage you to apply even if you don’t meet all 100% of the description or qualifications. Finally and most importantly, we are a proud Equal Opportunity Employer.",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Data-Scientist-Intern-United-States/1338394",
    "position": "Data Scientist (Intern) United States",
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": "What You’ll Do \n\nAcquire, clean and structure data from multiple sources and maintain databases/data systems. \n\nIdentify, analyze, and interpret trends or patterns in complex data sets \n\nDevelop, prototype and test predictive algorithms \n\nFilter and \"clean\" data, and review computer reports, printouts, and performance indicators to locate and correct code problems \n\nDevelop and implement data collection systems and other strategies that optimize statistical efficiency and data quality \n\nInterpret data, analyze results using statistical techniques and provide ongoing reports \n\nWho You’ll Work With \n\nWork on massive structured, unstructured, transactional and real-time data sets from a variety of sources to analyze customer usage patterns and provide actionable, intuitive, impactful insights using metrics, algorithms, and statistics.  \n\nWho You Are \n\nCurrently enrolled in a BS, MS or MBA program or equivalent in Computer Science, Mathematics, Economics, Information Management, Statistics or a related field \n\nYou know how to work a problem from beginning to end with data science tools and techniques, including data manipulation (SQL, Hadoop, etc.) and programming (R, Python, XML, Javascript, or ETL) frameworks \n\nExperience with Oracle databases is desirable. Strong knowledge of and experience with reporting packages (Business Objects etc). Knowledge of statistics and experience using statistical packages for analyzing large datasets (Excel, SPSS, SAS etc). \n\nTechnical knowledge regarding data models, database design development, data mining and segmentation techniques \n\nStrong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy \n\nProficient in queries, report writing and presenting findings \n\nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship \n\nWhy Cisco \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Product-Management-Specialist-Intern-United-States/1338685",
    "position": "Product Management Specialist (Intern) United States",
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": "What You’ll Do  \n\nYou will drive projects with market analysis and product definition while utilizing product management skill sets and methodologies. You will work cross-functionally through Cisco channels, business units and internal organizations while working with product managers to build:  \n\nProduct strategy documents including marketing requirements  \n\nProduct requirements  \n\nProduct life-cycle-commit process  \n\nJob-role analysis  \n\nYou will present to leadership and other members of the organization, identify process gaps and process implementation planning as you continue to support and further build organizational change processes.  \n\nJoin us as we transform the world of tomorrow. Develop creative ideas on how to work better and smarter. Influence and participate in top-priority projects that have a real impact.  \n\nWho You Are  \n\nCurrently enrolled in a bachelor’s or master’s in Business, Computer Engineering or an equivalent field  \n\nExperienced in product management processes  \n\nGeneral project and program management skills  \n\nYou possess strong communication and partnership skills  \n\nShow a proven understanding of product management, supply chain, demand planning, logistics and project management methodologies \n\nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship  \n\nWhy Cisco  \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box!  \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.)  \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward.  \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Consulting-Engineer-Intern-United-States/1338391",
    "position": "Consulting Engineer (Intern) - United States",
    "location": {
      "city": "Richardson",
      "state": "Texas",
      "country": ""
    },
    "description": "What You'll Do \n\nAs a Consulting Engineer Intern, you will gain hands-on experience on leading-edge technology. You will be mentored by some of the industry’s brightest minds who will help you challenge and develop your skills. \n\nYou will collaborate with and learn from industry-leading engineers. At Cisco, we value your ideas and perspective. We encourage you to innovate and push boundaries. You will join a team to build your technical expertise, learn Cisco specific technologies and how to build a positive experience for our customers. \n\nYou will make a proven impact on network infrastructure and solutions like security, mobility and cloud. Customer Experience covers full customer life-cycle experience. \n\nWho You’ll Work With \n\nLet’s change the world together. Work closely with your team to gain experience and insights into real-world customer deployments and challenges. Be immersed in a small close-knit group of cohorts, to collaborate on a variety of projects that have a real impact. You’ll learn from industry experts. We value your ideas, perspective on how to get things done. Work on network infrastructures. Deliver business solutions and technology solutions from data, security, mobility and the cloud. \n\nWho You Are \n\nCurrently enrolled in an associate’s, bachelor’s or master’s degree in a related field such as Computer Networking, Computer Science, Electrical/Computer Engineering, Information Technology, Data Science or a similar field. \nBasic computer networking fundamentals relating to IP addressing, routing, switching, TCP/IP and OSI model. \nAwareness and general understanding of how consumer applications work over the internet (e.g., Browser, Voice/Video calls, Social Networks, Streaming etc.). \nFluent in English with excellent verbal and written communication. \nPassionate about Computer Networking, Information Technology and Computer Science. \nProficient in Python, REST APIs, Automation. \nComfortable with Data Analysis, creating visualizations such as graphs and heatmaps. \nAbility to multi-task, self-start, work in a dynamic team environment and work independently. \nAbility to quickly learn new technologies. \nStrong analytical and problem-solving skills with ability to troubleshoot technical problems. \nWilling to tackle new challenges and develop new skills. \nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship \n\nWhy Cisco \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Software-Engineer-Bachelor-s-Intern-United-States/1338366",
    "position": "Software Engineer Bachelor's (Intern) United States",
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": "What You’ll Do \n\nOur software engineers are the gurus behind the scenes ensuring our all of our programs are easy to use and bug free. Using a keen eye, you’ll develop software and tools in support of many of our high-impact technology platforms such as operating systems, networks, databases and more. While we’re growing in the software business, you’ll still need to see the big picture and watch for hardware compatibility while even potentially influencing design. \n\nWho You’ll Work With \n\nOur hardworking team members are busy programming magic across the globe on teams such as Engineering, Information Technology, Supply Chain, Customer Experience, Security and Trust, etc. \n\nYou would play a crucial role in driving next-gen software innovations including cloud, mobile, desktop or security spaces. On any of these teams, you'll get hands-on experience working with applications that make technology accessible no matter what device they’re on. See the possibilities when creativity meets design and build solutions which will transform how we work, live, learn, and play. \n\nWho You Are \n\nPursuing a Bachelor’s degree in Computer Science, Computer Engineering, Electrical Engineering, or related program \nUp-to-date on programming and scripting languages: C/C++, Python, Java \nKnowledge of Linux, Networking concepts, OS fundamentals, Embedded Development, and/or ML \nHands on QA, Testing, and/or Debugging skills \nExperience with Databases, Web Application Development, and Web Services \nAble to legally live and work in the country for which you’re applying, without visa support or sponsorship \n\nWhy Cisco \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  },
  {
    "url": "https://jobs.cisco.com/jobs/ProjectDetail/Software-Engineer-Master-s-Intern-United-States/1338368",
    "position": "Software Engineer Master's (Intern) United States",
    "location": {
      "city": "San Jose",
      "state": "California",
      "country": ""
    },
    "description": "What You’ll Do \n\nOur software engineers are the gurus behind the scenes ensuring our all of our programs are easy to use and bug free. Using a keen eye, you’ll develop software and tools in support of many of our high-impact technology platforms such as operating systems, networks, databases and more. While we’re growing in the software business, you’ll still need to see the big picture and watch for hardware compatibility while even potentially influencing design. \n\nWho You’ll Work With \n\nOur hardworking team members are busy programming magic across the globe on teams such as Engineering, Information Technology, Supply Chain, Customer Experience, Security and Trust, etc. \n\nYou would play a crucial role in driving next-gen software innovations including cloud, mobile, desktop or security spaces. On any of these teams, you'll get hands-on experience working with applications that make technology accessible no matter what device they’re on. See the possibilities when creativity meets design and build solutions which will transform how we work, live, learn, and play. \n\nWho You Are \n\nPursuing a Master’s degree in Computer Science, Computer Engineering, Electrical Engineering, or related program \n\nUp-to-date on programming and scripting languages: C/C++, Python, Java \n\nKnowledge of Linux, Networking concepts, OS fundamentals, Embedded Development, and/or ML \n\nHands on QA, Testing, and/or Debugging skills \n\nExperience with Databases, Web Application Development, and Web Services \n\nWhy Cisco \n\n#WeAreCisco, where each person is unique, but we bring our talents to work as a team and make a difference powering an inclusive future for all.  \n\nWe embrace digital, and help our customers implement change in their digital businesses. Some may think we’re “old” (36 years strong) and only about hardware, but we’re also a software company. And a security company. We even invented an intuitive network that adapts, predicts, learns and protects. No other company can do what we do – you can’t put us in a box! \n\nBut “Digital Transformation” is an empty buzz phrase without a culture that allows for innovation, creativity, and yes, even failure (if you learn from it.) \n\nDay to day, we focus on the give and take. We give our best, give our egos a break, and give of ourselves (because giving back is built into our DNA.) We take accountability, bold steps, and take difference to heart. Because without diversity of thought and a dedication to equality for all, there is no moving forward. \n\nSo, you have colorful hair? Don’t care. Tattoos? Show off your ink. Like polka dots? That’s cool. Pop culture geek? Many of us are. Passion for technology and world changing? Be you, with us!",
    "company": "Cisco",
    "contact": "",
    "posted": "",
    "due": "",
    "lastScraped": "2022-02-27T17:18:00.281Z"
  }
]